[{"mikepurvis": ["Good quote; one of my favourite books.\r\n\r\nThe script-based nature of POV-Ray makes it that much more difficult to create really natural-looking scenes. On the other hand, it also makes it superbly well-suited to fractals and geometric designs.", "The prison study is interesting, but I'm still skeptical of any attempt to completely dismiss *other factors*.\r\n\r\nSurely it would be possible to correlate the TV watching, the junk food, and the violence all back to things such as parental neglect?\r\n\r\nI mean, I can understand their desire to lay fault with TV and fast food. Waving your hands and blaming \"the man\" are both much easier responses than placing fault where it belongs: with the working parents who are too busy for their kids, the school systems with understimulating curriculums, lax discipline, and teachers who don't give a crap.", "I agree. It seems (to me, anyways) that XP takes a while to *become* stable, but then it'll run pretty much indefinitely in the \"stable but fragile\" state, in which any disruption can send it down the pipe.\r\n\r\nFor example, I recently upgraded my Radeon 8500 display drivers to play a more recent game, and now I get VPU reboots every hour or so. I realise this is ATI's fault, not Microsoft's, but to the Joe Sixpack user, it's a problem with \"teh windows.\"", "Waiting until you're 100% stable to start a family? Seems a dangerous game to play. I agree with the notion of planning ahead and being established and so-on, but how far do you want to push it? At what point do the joys of childrearing outweigh the possible negatives?\r\n\r\nAnd how do you explain your position to the missus? \"I don't want to have kids because there's the possibility that we'll divorce in a couple years and screw them over.\"?\r\n\r\nI dunno. I think I'd rather be starting a family at 25 than 40. It depends on the future wife, of course, but there's some things where the risk just has to be taken, in faith that the reward is worth it.", "Of course, if you're a [markup nazi](), you wouldn't do &lt;strike&gt;AWESOME&lt;/strike&gt;, but instead &lt;del&gt;AWESOME&lt;/del&gt;.", "The thing about S5 is that it's all about the usage. If you're making an image-heavy presentation (which is most of them), then there's no getting around the fact that [Keynote and Powerpoint are quite simply the correct tools for the job]().\r\n\r\nIf, however, you're doing something like text-heavy, such as putting up [song lyrics]() or quiz-show questions, then being able to edit large numbers of slides en-mass is tremendously advantageous.", "I haven't taken history since high school, but isn't that simply a typical pattern for the evolution of a civilisation/nation?\r\n\r\nAnarchy -&gt; Military Gov't -&gt; Pacifism -&gt; Apathy -&gt; Implosion", "His argument is hinged on the definition of \"belief,\" and amounts to the following two points\r\n\r\n1. he *believes* that it's not possible to have knowledge of whether or not God exists, and\r\n2. he *believes* that God does not, in fact, exist.\r\n\r\nThe weaselly language cloaks the first one so that it's presented not as a belief, but as a \"position\" or \"claim.\" But it is, in fact, [a belief](): a \"[m]ental acceptance of and conviction in the truth.\"\r\n\r\nHe says, \"For all I know, there could be a God but I simply don't believe there is one.\" It sounds like a snide attempt to be open minded; to equate the level of his own *faith in the non-existence of God* with the opposite beliefs of the Christians that he mocks in his opening paragraph.\r\n", "Well, it's the accusation made in the linked article:\r\n\r\n&gt;Of course the real problem isn’t the single excerpted page being linked from Something Awful, but instead the fact that the image shows the extremely sloppy manufacturing process that is causing the MacBook Pro to run at temperatures as high as a 95 degrees Celcius under full load.", "&gt;The author's belief in the non-existence of god is evidence-based...\r\n\r\nI didn't really think Claim #2 was up for debate, since he states quite clearly in the article that he \"[doesn't] **believe** God exists.\"\r\n\r\nThe one that I'm disputing is whether or not it's fair to claim that an *agnostic* position is anything other than another belief. He says:\r\n\r\n&gt;More specifically, many agnostics (myself included) hold that it is actually impossible to know whether or not God exists.\r\n\r\nIs that an \"evidence-based conclusion\"? I would submit that it's his **belief** that such knowledge is impossible. If you happen to agree with him about it, then you can both high-five each other on having reached the correct conclusion. But lots of people claim to know that God exists, and plenty others claim to know that he doesn't... and all of them think they've reach \"evidence-based conclusions\" too.", "Ah, nice catch. Given that definition of atheism then (as opposed to [this one]()), it does seem very much possible to be both atheist and agnostic.\r\n\r\nNevertheless, my gut still tells me that he's just using semantics to give himself as many labels as possible. If he could find a way to be Buddist and Wiccan as well, he'd probably be those too, to all the more piss off the blood-thirsty missionaries.\r\n\r\nUnfortunately I'm getting a 412 on the article now, and it doesn't seem to be in the Google Cache or Coral. But it seems the debate has run its course. Can I just call him Hitler and be done with it? :)", "The article wasn't too clear about the locale of the events, but it seems that the school involved is probably [this one](), in NC.\r\n\r\nI'm pretty sure there were students who openly wore religious headgear at my Toronto high school. The only ones who got excluded were the ones who excluded themselves, by taking their ethnicity and turning it into an exclusive clique.", "The TTC has stopped posting schedules along some routes because they change them so frequently.\r\n\r\nFor the summer, I'm commuting out to a factory near 401 and 427. So I called their help line, and the operator said there weren't any buses that ran by there... but when I drove to work the first day, I saw two buses pulled up at the corner of Dixon &amp; International. When I asked one of the drivers, it turned out he did the 191 *express* route straight from that corner to the Kipling Subway. (Yes, this route is marked on the [Ride Guide](), but it's not exactly the clearest map in the world...)\r\n\r\nAnyhow, what's my conclusion? Simply that I'm not sure how Google is going to get the transit authorities of various cities to co-operate, and I'm skeptical about their ability to keep it all current.", "Interesting, but I believe the following is an error:\r\n\r\n&gt;5 NO RENTAL/COMMERCIAL HOSTING. You may not rent, lease, lend or provide commercial hosting services with the Software.\r\n&gt;\\t\r\n&gt;*You may not rent, lease, or lend your computer (including laptops) to anyone once it has Windows XP Home on it.*\r\n\r\nIt sounds to me like the EULA means \"You can't use XP Home for tasks that Windows Server is supposed to be used for.\"\r\n\r\n**edit:** Actually, reading it over again, I think the one in the article may actually be correct. I was taking the \"rent/lease\" part to mean that you can't \"rent or lease hosting services.\"", "I was going to make the fair use argument, but I wasn't actually sure about it. When scans of magazines are leaked to the web, people don't claim that it's legal under \"fair use,\" do they?\r\n\r\nThen again, maybe it's some wacky thing like you don't actually *own* the manual, you're just [licensing it from Apple](). \\*vision of manual self-destructing after being read\\*", "That's been NASA's mentality pretty much since its inception, and it has worked out pretty well for them.\r\n\r\nThe idea of sending people to other planets seems almost unfathomable, but where were we 1906? People didn't even believe the Wrights had flown yet! (Hell, maybe I've just been watching too much Firefly)", "Perhaps not that particular objective, but they raise lots of excitement and national pride every time they have a high-profile success.\r\n\r\n(Never to the degree of the manned missions in the sixties and seventies, of course, but I think the point still holds with regard to recent Mars trips, Hubble pictures, etc.)", "I can see the argument being made that it's fair use for Gizmodo to be posting the pic, in the interests of discussion. But is it fair use for the SomethingAwful user to be posting it? He was discussing the shoddy worksmanship, not the manual itself. His use of the picture posted was for its value as reference material, which was its original purpose.", "An excellent opportunity to demonstrate the dangers of [javascript injection](). (go ahead, click it, I dare you)\r\n\r\nIt's a good thing it's not Amazon or some other domain that might share an important session cookie with my arbitrary script. (Curious note: the angle-brackets *are* encoded properly in the header, just not in the JS output)", "Right, so you need a spiffy processor (which everyone has), but the generating algorithms can likely take a complexity parameter that gets scaled way back on graphics cards that aren't up to snuff on doing high polycount models.", "Part of the charm of the previous demo was in Wright's charisma, as well. It particularly came across in the [longer version](;q=spore) that didn't clip out his talks in between the demos.\r\n\r\nBut yeah, I agree with you... from an innovation standpoint, the GDC footage is far more interesting.", "My rule of thumb is basically, if I'm making a slideshow without any images then I shouldn't be using it.\r\n\r\nA slideshow should provide stimulating visuals that *supplement* a talk, rather than *subverting* it. No clipart, no stupid graphs, and no slides of bullets. Except *possibly* for a conclusion.\r\n\r\nSome of the best powerpoints I've seen have actually been in churchs. This shouldn't be a surprise... the pastor who uses a slideshow has already been presenting in public for years without it. So he's going to make his slides supplement the oral delivery, or he's not going to bother.", "Spazoid coming through...\r\n\r\n&gt; Ezekiel: [But you trusted in your beauty and used your fame to become a prostitute... Such things should not happen, nor should they ever occur.](;&amp;version=31;)\r\n&gt;\r\n&gt; Moses: [If a priest's daughter defiles herself by becoming a prostitute, she disgraces her father; she must be burned in the fire.](;&amp;version=31;)\r\n&gt;\r\n&gt; Paul: [Do you not know that he who unites himself with a prostitute is one with her in body? For it is said, \"The two will become one flesh.\" But he who unites himself with the Lord is one with him in spirit.](;&amp;version=31;)", "It seems a little absurd, since you don't need a driver's license to drive a ride-on mower.\r\n\r\nOn the other hand, he *was* off his property, and a ride-on mower can still deal a fair bit of damage with an inept driver.", "That sounds about the size of a typical rez room. The location must be awfully good to demand that rent for what's basically a large closet.\r\n\r\nI wonder if there'd be a larger market for these kind of \"microflats\" in major metropolitan areas?", "&gt; Excitement and national pride aren't the metrics I would use to judge a succesful space program.\r\n\r\nReally? Because they're most certainly the metrics that politians use when deciding how much to fund them... we can all hold hands and pretend that NASA is this ivory pinnacle of academia, but it's really just another franchise like the NHL, except that the players are elite scientists and researchers rather than steroid junkies.", "I dunno where you're writing from, but let me just say, speaking from a Canadian university campus, you've got things *completely switched*. There is pretty much *zero tolerance* for debate regarding homosexuality (you accept and celebrate it, or you're a last century xenophobe). But if you want to come and give a guest lecture on gnosticism and how Christianity is all just a great big fantasy, I'm sure our student council would welcome you with open arms.", "Avoiding the problem doesn't make it go away. I was homeschooled until grade 7, and although I was academically prepared to \"enter the system,\" all the way through high school, I had the feeling that I wasn't quite as socially *there* as my peers.\r\n\r\nPart of life is being manipulated and taken advantage of; better to learn how to deal with it earlier on when the stakes are lower.", "There are legitimate criticisms of XML, but you know, it does a pretty damn good job at the job it's meant for. It's mostly garbage like SOAP that overcomplicates matters with a zillion type wrappers and other nonsense.\r\n\r\nI recently had to write a parser for the binary metadata on TIFFs... made me appreciate what an important step XML is for programmer usability/sanity. \r\n\r\nAnd don't even get me started on XML-DBs... once you can make a database that's an actual nested structure instead of a bunch of tables and ID numbers, hacks like ActiveRecord become practically trivial.", "Yeah, it was fire for the priest's daughter. For everyone else's daughters, it's just the prospect of a land filled with wickedness:\r\n\r\n&gt; [Do not degrade your daughter by making her a prostitute, or the land will turn to prostitution and be filled with wickedness.](;)", "I'm right there with you, man. Props to her for being top of her year and all, but a university campus offers you a lot more than just classes. If she knew it was coming and didn't take advantage of the opportunities, her loss.\r\n\r\n**addendum:** And as for the cheeky \"waste of time, no plans to swim again\" remark, she's 10x more likely to one day go swimming on vacation than she is likely to use half of what she learned in lecture. An electrical engineering degree for a stock market job?", "The 320x240 screen is nice. I don't know if the processor could run something like DOSBox, but it sure would be awesome to bust out Skyroads and Keen and Galactica and all the other classics. (Not to mention sweet adventure titles like Space Quest, Indiana Jones FoA, Monkey Island, etc.)\r\n\r\nI remember be excited about the original GP32, but for some reason I just never actually ordered one.", "As someone who actually likes to bake and prepare nice meals every now and then, I don't know how I'd feel about this. Then again, if I was [living in a closet](), I might find the notion a sight more acceptable.", "&gt; Yes, many public schools are in bad shape today. There are many reasons for that. But vouchers won't solve the problem.\r\n\r\nThis seems like kind of a *thin* conclusion. Vouchers would force the bureaucrats in charge to take an honest look at the quality of service they provide, and stop cutting teachers while they raise their own salaries.\r\n\r\nCompetition means that a short budget forces them to improve... under the current system, a short budget means \"whine to the liberal press about how you're underfunded.\" (which screws over home- and privateschoolers all the more, of course)", "&gt; the net effect will be that **those schools which can** will start charging supplementary fees, and those who can't will find themselves at the bottom of the pack again.\r\n\r\nIsn't that sort of what we have now, except that *everyone pays for one system, whether they use it or not*, while the \"competition\" can barely afford to stay in business?\r\n\r\nAt least it's a fair assumption that \"those schools which can\" will be deserving of the extra funding. Either that, or people abandon them for cheaper alternatives, which is what the whole debate is all about. The point is not to completely deregulate the system... obviously the government would need to have some kind of department that could run standard tests and maintain school rankings, etc.", "I concur. The cascading comment score effect really affects the ordering of the comments in a positive way.\r\n\r\n(in other news, it would be cool if the scores even affected the root node... so that articles with high-quality discussions ended up higher on the frontpage.)", "Ironically, new Apples come with a mechanism for painlessly switching to Windows. Of course, it's only because they know that [OSX owns it]().\r\n\r\nClearly, none of the search engines have this same confidence. (least of all Google, who's already the default in FF and Opera...)", "Boot Camp is more than a boot manager. It burns a disc for you that sets up the exact device drivers that you need to install a perfectly functioning XP.\r\n\r\nTo add any non-Windows OS to the XP boot manager, you have to manually edit INI files.", "&gt; It happened during the Crusades...\r\n\r\nWhich, of course, illustrates the point perfectly, since the Crusades were a case of political powers leveraging religious sentiment for their own gain.\r\n\r\nThe difficulty I have with any crusade-based argument is that *the crusades were 800 years ago!* Radical muslims are busy blowing people up *today*. It's not fair to make blanket statements that span nearly a millenium.", "Okay, this is \"library\" as in the classical sense... like, you go there, look stuff up, and then use it.\r\n\r\nIt's not a *programmatic* library, which makes no sense for stylesheets, since there are no function parameters. (although some folks have [come close]()...)", "I'd be curious where the $300B would go in the case of Kyoto. I mean, even if the war is outrageously expensive, isn't *most* of the money still staying inside the country? Like, they're paying American soldiers, buying gear from American companies, probably fuelling the tanks with domestic (or captured) oil... I realise that it's not an economic stimulus the way WWII was, but it's not like they took $300B and used it to buy Spanish silk.\r\n\r\nWhat would it have been spent on in the case of Kyoto? (I really don't know...)", "&gt; With war, spending is a waste, and used to destroy opponent's wealth. Fuel, amunition, and soldier pay only has a positive impact to your side if you win and steal opponent's wealth. Only the outcome has value. The effort itself is wasted.\r\n\r\nI'm having trouble following the thrust of your argument. I don't necessarily disagree, I'm just not really seeing what you're getting at. I realise that breaking windows is not stimulating the economy any more than Iraqi bombers blowing up US tanks... so any destruction is clearly spent goods, or *waste*.\r\n\r\nBut as for \"stealing the opponents' wealth,\" whether or not that's what Iraq is all about (I [doubt it](), myself), I don't really see how that's a possible resolution in a lot of cases, even when a war is *won*. After WWI, the rest of the world basically crushed Germany's economy by making them foot the bill for the expenses... after WWII was done, they realised how stupid that was and actually went in to rebuild the country. At additional cost, of course, but it was the price of security. (Basically, it's not like the US can just shake down every Iraqi for their trinkets and valuables, and then bring them home in a big pile on an aircraft carrier...)\r\n\r\n&gt; Its about home insulation and building and purchasing technology to cut emissions.\r\n\r\nSo then, is most of the cost-to-government in subsidizing these things? Like, giving tax-breaks to eco-friendly businesses?\r\n\r\n&gt; It also does so without murdering innocent people, training terrorists to come kill your family, or perpetuating great evil that makes your death through terrorism entirely deserved.\r\n\r\nNot to jump down your throat, but the article is about the *economic* impact of the war. There's plenty of other articles and discussions on here about how Bush is a Bad Bad man. The moral issues and rationale of the war are a separate debate.", "The name attribute still has a genuine purpose, as of XHTML 1. And that is for grouping radiobutton controls, and other tasks related to form element naming. Name and Id serve different kinds of tasks.\r\n\r\nAt any rate, just keep in mind that with XHTML 1, backward compatibility has been maintained with previous versions of HTML. As of XHTML2, no current browser will know what the hell anything means. (For a simple example, see the [navigation list]() stuff...)", "An extra freebie about &lt;label&gt; that a lot of people don't realise is that this:\r\n\r\n &lt;label for=\"my-widget\"&gt;...&lt;/label&gt;&lt;input type=\"text\" id=\"my-widget\" /&gt;\r\n\r\nCan also be written as\r\n\r\n &lt;label&gt;...&lt;input type=\"text\" id=\"my-widget\" /&gt;&lt;/label&gt;\r\n\r\nMay not always be convenient to wrap the label element around the form element, but it gets you out of having to specify the **for** attribute.", "It would have been fine if they'd thought of it back in 1995. As it is, it's basically just a cash grab for whatever company is put in charge of the TLD. Every single existing established pornsite will suddenly need to buy (bid on, even?) their own brand name, to avoid some jackass squatter picking it up.\r\n\r\nIt's not \"protecting the children.\" It's simply that it's stupid and unnecessary. And it opens the door to discussions about whether porn should exist on traditional domains once there's a dedicated spot for it. (Which, of course, means debates about art, hentai, nudity, expression, censorship, and what constitutes a legitimate governing body, etc...)\r\n\r\nLike I said, stupid.", "&gt; He then, in this guise of being well informed, gives credence to ID.\r\n\r\nI think it's more just that he doesn't accept stuff at face value, and he likes to stir stuff up by taking contrarian positions.\r\n\r\nBy giving legitimacy to ID, he forces evolutionary scientists to actually prove their claims to the general public, rather than just patting us on the head and saying \"don't worry, we're right, don't try to think too hard about it.\"", "PHP supports arrays of checkboxes using square brackets in the *name*, not in the id. I believe this used to be the Ruby on Rails behaviour, as well, although they seem to be using underscores for that purpose now.", "Interesting. My [comment that's getting roasted]() perhaps was not so far off the mark then... according to him, this Dover trial *did* constitute a publically accessible debate involving the \"best of\" both sides.\r\n\r\nI'd be interested to check into it more. Most of the writing on the topic (from both sides) is intolerably snide. But a judge has to reach a conclusion without sneering at one of the positions.", "I'm only 20, and my listening list is a lot of classic rock, blues, jazz, and pop. But I do have the *occasional* rap song stuck in there.\r\n\r\nEven though it's a little overbearing, you might enjoy checking out the film *8 Mile*...", "Definitely. I was amused reading about Lindsay Lohan's new flick... Samaire Armstrong is 10x hotter, and her name's not even on the poster.\r\n\r\nThey're both beautiful women, of course, but the Anna Stern character is so overwhelmingly likeable in personality that it gives Samaire a big boost. (Disclaimer: I'm only partway through S1, so if she turns into a bitch later on, I don't want to hear about it...)", "Your basic point is correct, that publically funded programs tend to \"level the playing field.\"\r\n\r\nBut there *is* gov't favourtism toward the wealthy. Swanky neighbourhoods get better law enforcement, for example, as well as other services. Not that this isn't fair, of course, but it would be helpful in the context of the story to specify that not all the men's meals were the same.", "It seems here like the only advantage over \"traditional\" social bookmarking services is the fact that you can use it like a GChat popup on Google search results.\r\n\r\nAnd plus, it's the Google brand, so it'll tap a new market that wouldn't consider using something freaky like Delicious.\r\n\r\nBut anyways, Reddit does some of this already, doesn't it, with the saved-sites page?", "I would think that should depend on the type of establishment. If it's a place you go to and get smashed sitting alone at the end of the bar, then sure.\r\n\r\nBut if you go with friends and a have a jolly old time, there's nothing wrong chatting up the help.\r\n\r\nPerhaps I'm just confused because you said \"bars\" rather than \"seedy clubs.\"", "My favourite booth babe story was from a couple years ago. Apparently some company hired a bunch of leggy women to wander about the convention floor, inconspicuously dropping things and then bending over to pick them up.\r\n\r\nOf course, beneath the ridiculously short skirts, they had the company's logo printed on their underwear.\r\n\r\nAnyone remember who did this?", "Interesting piece, for sure.\r\n\r\nBasically, he's describing a mechanism for doing the recommendations, and then advocating that for logged-in users, the recommended page replace the hot one.\r\n\r\nThe real trick there, though, is the technical challenge. Processing the billions of votes and re-ranking every article per-user? Pretty ambitious.", "Congratulations. You've publicly declared your ignorance and will never be hired by a company looking for a modern web site.\r\n\r\nI won't pretend CSS isn't hard. [My own site]() is a disaster on the IE7 beta; I haven't even looked yet at how to fix it. And yeah, floats are not a particularly ideal layout technique. But [the solutions are out there](). \r\n\r\nCSS is a huge step up from colspans and spacer gifs.", "Right, but it's proper daytime attention that creates real bonds. You know, taking time to read to them, play with them, etc.\r\n\r\nAs exciting as Dora the Explora is, it's no substitute for real parenting. And nor is keeping the kid in bed with you until senior kindergarten.", "I wonder if a game like Spore would appeal to a gamer like him?\r\n\r\nIt seems to be the Nintendo game that's not a Nintendo game. Innovative, unusual, and family friendly, but not overly cartoony. It's got some of the social \"Sims\" aspect, but without the hardcore MMORPG headset smackdowns.", "This argument sounds warm and fuzzy, but it's just not realistic.\r\n\r\nIs age 6 the correct time to start grade 1? Maybe some kids could take it earlier, perhaps others should have a chance to mature a bit further. But does the state care? No, everyone starts school at the same age.\r\n\r\nSome things in life are adaptable... other things must be adapted to. A young child requires nurturing and care, but there comes a point where they have to learn to go to sleep on their own. And yeah, that might mean that they lie in the crib and howl for 20 minutes before they discover the alternative.", "But if the logistical considerations didn't exist, would you really think it appropriate to start a kid learning to read and write \"when his parents feel he's ready\"?\r\n\r\nI'm a big believer in letting parents do their own thing, without the state interfering all the time. But there's surely a balance there... should it not be *society's expectation* that certain milestones are acheived at certain ages?"], "Fountainhead": ["People are upvoting topics they think everyone should read.  So they see \"bush sucks\" it gets an upvote, not because they read it but because they think others should read it.  If that weren’t happening then you would only see one or two really good NSA/Colbert/Bush Sucks posts in a day instead of 10.  Conversely if it's positive about something that they don't agree with they downvote it, not because it isn't interesting but because they think others shouldn't read it.  That's why there has been crap on here for the past week.", "I do not not dissagree with you, or more easily said, I don't agree with you.  Basically Gernika is curious why the posts have sucked lately.  You would have him cut off his head because he doesn't like his hair cut.  Personally his post is the only one in the past few days that had something interesting to say.  The comments have also been fun to read.", "I think this proves his initial point as well as the initial posters (gernika).  He has a good point here and he has negative points for it.  Is it a good comment... Yes... Do people agree with it No.  That's why reddit has been boring lately.", "That's not the issue.  The issue is that these articles continue to dominate the top. I'm sorry but 20 posts about the NSA is too many, and they are all of the same vane and viewpoint.  Same with the bush articles, all the same vane and viewpoint.  I'm sick of reading the same thing over and over again.", "Interestingly enough in apartheid south africa the racist labor union often tried to get the minimum wage increased to price unskilled blacks out of the market.  If the minimum wage really worked why not set it at $1000 an hour?", "I think you are missing the point that you can get education in this country.  Free Market + willing to work + education = Not Jobless.  If you are making minimum wage you need to gain skills so your work is worth more.", "They don't have to \"just work harder\" they need skills that are worth something.  Raising the minimum wage doesn't impart people with skills.   That’s why having a minimum wage does not help people.  It just pushes people with NO skills out of the employment market sending the wrong message to people.  \r\nHigh school kids make up the vast majority of people making minimum wage, because they don’t have skills.  If we raised the minimum wage employers would simply not hire high school kids because they don’t offer enough skills to justify the cost of employment.  \r\nLets take a paper route for example.  It’s basically a job that many young people get because there are little skills involved.  In many states the minimum wage is so high that most paper routes are done by higher skilled and more reliable labor, adults, to offset the cost.  This happens in all areas.  In the 80s the cost of picking tomatoes was getting so high that many farms went to an automated systems.   Educated people gained work and a whole lot of unskilled labor lost theirs.  If you want to help people give them skills don’t price them out of work so they have to rely on the state.\r\n", " - Is my source.\r\nIt's not about cheap labor, it's about making a profit.  Why not $1000 an hour, because most people would be out of a job.  Most people are not efficient or skilled enough to make that much an hour.  Raising the minimum wage does not increase thier skills.  If it did the third world could just institute a $5 minimun wage.", "I dissagree that it's a straw man.  If I had said \"why don't we just give everyone a million dollars\" that would be a straw man.  My point is that you can't abritrarily set a minimum wage, it doesn't increase the value of the work done, it just increases the threshold of we consider a valid job.  For example I might employ someone for $2 an hour to clean my porch, if I can find someone, but for $5 an hour I'll probably just do it myself.", "Well any nation that has free markets and embraces capitalism are doing far better then the opposite.  How is china getting out of abject poverty... looking to capitalism and free markets.  Please show me an example of socialism working moderatly well?  I'm sorry but as much as you wish Venezuela is an example it's not.", "\"The freeest markets on the planet have all been in South America\" uhm, could you name a few?\r\nI completely agree that education and research is what helped the US to become so successful, but that came about mainly because of our freemarket system of higher education.", "Your question of \"...anyone who praised the Soviet Union after World War II\"?  Lets see... most of the communist parties currently active in Europe and Eastern Europe still believe that the USSR was great.  Though communist china is getting more capitalist they still think that the USSR was great.  Did you want American examples?", "Europe, china, russia also has goverment/military funding of university research.  \r\nJust give me a couple country names that I can work with.  I don't want to start with Guatamala just to have you say \"that's bad example of central/south america.", "Try mounting a protest to bring down castro. Currently you would have no access to the media and cannot legally hold public meetings.  Sounds like a great place to live... Ever wondered why people risk death to make it to the US from Cuba?", "yea, agreed on the banana republic thing.\r\nYour article on \"free markets\" in south america didn't really explain anything other than reforms that they needed to make didn't happen. Pegging a currency is not a free market idea, it's the opposite.  Pegging a currency is something that China likes to do.  \r\nThey did privatize industries but without a working currency it's hard to keep things working long.  They needed to make reforms to labour laws, social provision, infrastructure and trade to make any serious attempt at free markets to work.  The first 4 years where they were making changes showed great improvements to Argentina as soon as they stopped the country again went back to being less than what it could be.  Argentina failed for a lot of reasons but it's hard to demostrate that free markets and capitalism did it.\r\n", "No, he said that \"..there was praise lavished upon Soviet efficiency by leftist professors during the Cold War\".   I tried to find some articles that might be an example of this from the 80s, but couldn't find anything very convincing.  There were a few references to the efficiency of the Russian space program, \"they use pencils, we use a million dollar pen\", ...it costs far less to get to space in Russia... etc.  So I can't find an example, but I think you would have to admit till the complete collapse of the USSR we didn't really understand how poor their system worked.", "Ideally in a communist system there would be no need for money.  The state would take care of you and you would take care of the state, everyone would make the about same amount of money and receive roughly the same amount of benefits.", "CEO salaries have been going up and up because it's harder and harder to find experienced CEOs.  Over the past decade a lot of new firms have started up and often need experienced leadership, this is hard to find and so CEOs are a very rare commodity.  That is why they have been spiraling up.  If we had more CEOs available you would see them get paid less.", "Free markets and capitalism means that you don't have corruption. Corruption ruins free markets and distorts capitalism.  Don't be confused.  You have to have a functioning government to have free markets and capitalism.  It's the governments job to keep things fair.  Capitalism and free markets don’t make murder illegal, governments do that.  So far democracy has been the best government system.  Jack Abramhoff and  Tom Delay both not only undermine capitalism and free trade but they also undermine democracy.", "So if G. Bush started pushing a bill to allow him to run as many times as he wanted you would have no problem.  People saying \"Bush is trying to take over America\" would be idiots?  You would say Mr. Bush has every right to run as many times as he wants?", "I have protested quite a bit to appose the war in Iraq, I was vocal against the re-election of bush.   I also wrote and spoke with many of my friends to try to change their minds.  I didn’t see any violence at any of the events I went to.  Last time I checked the government wasn’t trying to track me down either.  The human rights watch even has bulletins about the conditions in Cuba.    \r\n“difference is one of degree rather than kind”  No, you go to jail in Cuba, they actively look for you and try to silence you.  If a person broke your ribs here you have recourse, press charges, sue them.  You don’t have that option in Cuba.  I don’t see how you can disagree with so many international human rights organizations.   \r\n", "They had a dictator that chose to follow free markets and capitalism.  The freedom eventually led to his opening up to democracy and a somewhat peaceful exchange of power. Chile is still the envy of South America though it's moving more left and that is slowing down their advancement.", "1. Light poles are meant to fall over like that.  They are held together by shear bolts to try to save lives when cars crash into them.\r\n2. They didn't break windows because they are bullet and shatterproof windows.\r\n3. Hitting a mountainside and a wall are 2 very different things.  If they had hit a granite cliff you may have a point.  As it is the engines pretty much got vaporized.\r\n4.  &lt;-- please look at this link as it will explain things for you.\r\n5. If the police had a tape of your mom getting murdered would you want the world to see it?  I wouldn't, but for this i agree they should release more to stop the insanity.\r\n", "A good free series to watch is \"commanding heights\" A 2002 look at emerging economies made by wgbh for PBS, it takes a good look at Chile.   \r\nThe  has some great information but many of the articles are for subscribers only, though some days they have free days were you can look through everything.\r\nIt's hard to find good articles that are factually accurate and not misleading.  Start with the pbs series, it's at least interesting and as unbiased as biased people can be.\r\n", "I couldn't agree more, but so far the only pressure that seems to be opening up china is free markets and capitalism.  If China is ever to be free they will have to continue to look to capitalism and free markets.  They will have to continue rid themselves of corruption and oppression.", "Take oil, it's a perfect example of all three items you list.  The best way to distribute it is to allow buyers to set the price.  Even though OPEC controls some of the price (through production) it's mainly set by the buyers.  Currently we have no better system of distribution than the free market.  A single organization would fail miserably if they artificially decided the price of a barrel of oil.", "1.   you mean like this?  The wing broke the pole in half... and bent it.\r\n2. -\r\n3. A mountain is a slope, so when the plane hits it tends to skid and bounce, when a plane hits a wall or cliff it tends to be completely obliterated.  Think of a car going off the road compared with hitting a wall.\r\n4. The quote comes from a \"Honeywell’s Aerospace division in Phoenix, Ariz\" an unnamed expert said \"turbine disc—there’s no way in the world that came out of an APU of a Auxiliary Power Unit (APU) mounted in the tail section of a Boeing 757\"  Well duh.  It came from a side mounted RB211 engine.  Also nice to trust an engineer that received \"a couple pictures\" and failed to give his name.  Does he still think this?  no one knows, what photos did he get to see? no one knows.  \r\n5.  Basically I agree, I don't understand why the government keeps this stuff secret.  We don't see anyone die just the plane. It would be nice to have more info.\r\n", "I would suggest that most of South America has a form of \"a socialized market economy\".  \r\nFrance and Italy seem to be working great!  I pity Britain and Germany for their audacity to move to a more free market capitalist system.  But seriously are you saying that france and italy are doing great in comparison?", "Interestingly capitalism and free markets do, in a way.  They challenge china to allow their people more mobility and freedom to change their lot in life.  China has never been under more pressure to change.  Capitalism doesn't just \"make things easy for big business\"  if capitalism is free to work correctly there should be competition to make it harder for big business.  Before capitalism the big companies had it easy, they controlled everything about their business without the worry of competition, they could do what ever they wanted with no fear of going out of business.", "On your second comment.  There is a difference, capitalism is an economic system based on the private ownership of the means of production and distribution of goods, characterized by a free competitive market and motivation by profit.  Free market is kind of a sub idea but important because it reminds us that we need to allow everyone to buy and sell.  But on you your point.  You are under the assumption that there is a finite amount of capital.  It doesn't really work like that, we make capital.  A shovel doesn't just appear you make it, you build that capital and own it and can then sell it.  Maybe you are thinking about resources like oil, at some level you have to allow companies to in effect \"own\" the production rights.  That doesn't mean the state shouldn't negotiate the best possible price.  Both canada and alaska make billions off the oil they have, as well they should.  That doesn't mean that the oil companies shouldn't make money, they should, but they should have to compete to be the best producers of oil they can be for their \"host\" countries.", "I agree.  Though I think you will see the US stabilize again in the coming years, and hopefully move more toward free markets.  I was sad to see the Doha trade talks collapse.\r\n\r\n\"Celtic Ireland was a stable anarchy\" I'll have to read up on it but it doesn’t sound like the best of places to live.  I’m not a big libertarian.  \r\n\r\nI agree that we are not at a \"maximized\" rate.  The US has barriers to capital, education, and allows too many monopolies.  Thankfully we are still growing and are the envy of the world in higher education system.  \r\n", "You mean that you couldn't see anyting other than the 3 pixals of white blur?  I don't even know if that's the front of the plane or the wingtip.  I wish they would just release all the video they have.", "\"once capital is already inequitably divided, the market has already lost its freedom - there's already a bar to entry\"  Even though capital can create new capital through loans to other business or capital investments in ones own business that doesn't mean it's a bar to entry.  If you have a working capitalist system there is no \"bar to entry\" because of \"inequitably divided\" capital.  Capitalism allows anyone to try to create competition against another seller.  If you have a company engaged in anti-competitive processes the government needs to step in and stop it.  It's hard, but anyone can enter and compete.  Look at Google coming in and toppling Yahoo.", "I agree with you, to a point. There are always new entrants to the market though they may be small. Very rarely do you see only one provider. I don't disagree that big industries tend to converge but there is still competition. Here are the players in Britain along with number of stores. Somerfield (incorporating Kwiksave)1 1277 Tesco 775 Safeway 480 Sainsbury's 517 Marks &amp; Spencer 297 Asda 258 Morrisons 119 The list keeps going but those are the main players. This is far better than just having one or two. When that happens the government needs to step in and see if there are not problems in the system.", "How does it tear down the credibility of the critics?  All it shows is that the joke that is the IMF and World Bank is a bigger sham than people think.  Bolivia didn't take over the fields they simply mandated they had controlling rights.  They unilaterally remade the contracts the state agreed to in the late 80s.  That is their right, though the next time they look for international investment they will find it more costly.  This is the second time Bolivia has done this and that is why they got a poor deal from the oil companies.", "Are you seriously saying that people can't listen to music with other languages?  \r\n\r\nNo, he didn't, he asked that they change the law so that he could continue to run for president.  Similar to if Bush wanted to run more than 2 times.  I would be in the streets tomorrow if bush started trying to do that.   \r\n", "\"A truly free market has no restrictions on producer collusion\" \r\nA free market only means that there is no government pressure on price and wage levels and that there is free competition.  Producer collusion disrupts free competition and is therefore not part of a free market.   So if you DO NOT have a free market you may have producer collusion.  Not the other way around.", "You would be correct if there was no change in efficiency and technology.  Then and only then would monopolies achieve the greatest “economic efficiency”.  However competition over time is a much better at achieving “economic efficiency”.", "Yes, I agree with what you just wrote.  But above you insinuated that free markets have monopolies.  They don't, once you have a monopoly you stop having a free market.   They are mutually exclusive.  Government has to ensure the continuance of a free market or it won't be free for long.", "I agree with everything you just wrote.  Often due to geography or other factors there is little to no competition.  That doesn't mean it's not operating in a free market.  If the variables change a new store could open up.  Also if the local store prices everything too high for the area often people will simply drive a greater distance to get cheaper goods.  But the basic laws of a free market are still in effect even if there is only one supplier in that area.", "I completely agree, I can't agree more!  I'm not a libertarian; government has many many jobs to do.  The biggest and hardest job is ensuring a functioning capitalist system with a free market for all the participants.  My main objection to much of your comments are a seeming degradation of free markets and capitalism.  I don’t believe that.  It’s a failing of government if it can’t keep a free market in which capitalism can work.  You have to have laws to protect rights and freedoms.  Certain things are unacceptable, murder, slavery, destroying the environment, government has to pass laws and protect it’s citizens.", "I'm a little confused, though I like Anton Wilson. :)\r\nIn what sense are you pro free market if you think trade can only exist between equals.  Should America not trade with China or South America?  What sense are you anti-capitalist?  Do you think the government should control companies?\r\n", "Yes, but not in Venezuela.  Venezuela's constitution allows a president to be reelected only once in immediate succession.  He wants to change that by referendum, allowing himself to continue to run as long as he would like.  Yes, I agree it's up to the people of Venezuela to decide, but it'll probably be a simple majority.  Also Venezuela has a system currently that grants the president quite a bit of power in compared to a Prime minister in a parliamentary system.  You are comparing apples and oranges.  Most presidencies have a limited number of terms to keep power from getting too isolated.  It's one more step in a erosion of a working system.", "I'll take a stab at your questions though others my have a much better explanations &amp; facts.  \r\n\r\nStop me if I'm wrong but you are asking why the plane didn't crash into the ground?  It's better to think about a rock skipping.  I think it did touch the ground but it's just going to bounce off it.  The plane is going to tend to stay right above the ground because of the pressure effect from the ground being so close. \r\n\r\nI'm not sure what you wanted engine wash to do, but the explosion from the impact would have been many times more devastating to the surrounding area.\r\n\r\nAlso keep in mind how fast the plane was going when it hit the light posts. Even if the plane was going very slow picture it hitting the light posts, they are going to topple over with very little damage to the wing.  Going faster the wing has even less trouble with the poles.   \r\n", "From my reading, I’m not sure it did touch the ground before it hit.  I'm just saying if it did hit the ground it wouldn't have blown up just for touching it.  Also it may not have left much of a mark if it did.  All the fire vehicles would have corrupted any of the evidence of that anyway.  The nacelles are not giant shovels.\r\n\r\nWhat do you mean \"below the deck flying\"?\r\n\r\nSome of the light posts were split in 2.  There was probably damage to the wings too but between the light posts and the wall there wasn’t much time for it to affect the plane, the path or the end result.   It’s obvious the posts didn’t sheer off the wings or the poles would still be in one piece, standing.\r\n\r\nFully throttled jet engines do flipp 2 ton cars but that's assuming the jen engine is stationary and that the cars are in direct path of the enjine.  This one was going very fast so it minimized the force.  Think of throwing a ball backward while traveling in a car. Also there wasn't much in the path of the air out of the engines. \r\n\r\n", "It's the difference between a prime minister and a president (chief of state and head of government).  A prime minister is primarily ceremonial, usually he is just part of the parliament and represents the majority party or coalition and of course country as a whole.   A president does not sit in parliament, has no vote, and does not represent the majority in parliament (congress).  He/she is independent of congress but has the power to pass or veto laws that congress creates.   A president also has complete authority to appoint everyone in the executive branch (at a certain level) and appoint justices to the court.", "\"absolutely no evidence\" Wow, what an incredibly good argument.  \r\n\r\nI get the sense that you believe in this like a evangelical believes in creationism.  There is absolutely nothing I could show you to change your mind.  No evidence will be good enough.", "No, the EU is not a melting pot compared to SF, LA, NY, etc.  France has some immigrants but they are not integrated.  Just having immigrants doesn't make you a melting pot.  Right now in france there are two pots and they are not getting together.  Last time I went to Europe I saw a whole bunch of Europeans and a few others.   Britain is doing a better job but still lets look at the stats: white (of which English 83.6%, Scottish 8.6%, Welsh 4.9%, Northern Irish 2.9%) 92.1%, black 2%, Indian 1.8%, Pakistani 1.3%, mixed 1.2%, other 1.6% (2001 census)", "I understand that.  You have to admit though there is quite a difference between a US president and a Canadian PM.  A President has more real personal power.  This is why it's scary to see Chavez extend how long a president can serve.  We have limits on how long a president can serve to avoid a power grab and the creation of a dictator.", "That \"white\" population has a huge amount of Mexican people, it also includes eastern European, Russian, and EU people.  \r\n92.1% of UK people have had multiple generations of being UK.  In America 1 out of every 3 new Americans is an immigrant (the other 2 are babies).  More than that America is able to meld these people into our population.  We don't have people burning things in the streets because they feel ostracized.   Even our Muslim population is able to integrate into our masses.  Sure it’s not easy but we have a history of doing it the best.  We are a melting pot, you could argue that the EU is learning but they are not there yet.\r\n\r\n\r\n", "He is saying that a PM and a US president are the basically the same.  They are not.\r\n\r\nAs soon as parliament doesn't like the PM, he is gone.  If the PM doesn't like a bill and the rest of his party does, he either has to vote for it or the parliament will get rid of him.  If a president doesn't like a bill he just vetoes it.", "Point taken.  I also failed to include the producers into the oil mix too.  In general a group deciding a price is bound to fail at it because they have no way to figure out all of the potential buyers needs and wants.  Some things have to be run by the government but when they do they do it with the understanding it won't be as efficient.", "An excellent point!  There are fantastic minds in Europe, however they have little hope of starting a startup.  That's the whole point. Europe currently isn't conducive to start ups.  Paul gram is trying to explain why that is the case.\r\n\r\nNo one is saying that the rest of the world doesn't contribute they just aren't the hub.", "You can't.  It's ridiculous to build tracks and have a train go to towns with populations of less than 20,000, which is most of Texas.  Even if you did spend the astronomical amount of money to link all the towns, how often would trains come?  You think everyone lives in a city of 100,000?", "How do you keep monopolies under control?  How do you keep foreign governments from taking over?  How do you keep corruption at bay.  How do you keep public health in check?  How do you keep people from having slaves?  How do you keep people from raping other people?  How do you prove guilt or innocence.... etc....", "There were a lot of problems with the kyoto protocal.  \r\nFrom the economist:\r\n\"To be effective, a global-warming treaty must be global. But Kyoto imposes no obligations whatsoever on China, India or any other poor but growing economy. Rightly, the newly industrialising world refuses to pay for the mistakes of the already-industrialised world. It would rather be free to repeat them. Emissions per capita in these countries are still small. But they have a lot of capita. China’s emissions per person are less than 14% of America’s. But China as a whole produces more carbon dioxide than any other country bar America (see chart).\r\n\r\nIt was these flaws that prompted America to pull out. But another flaw may have tempted Russia to stay in. Kyoto capped Russia’s carbon emissions at their 1990 levels of 647m tonnes. But Russia’s industrial collapse in the 1990s cut those emissions to just 400m tonnes. Russia is thus unlikely to fill its quota of greenhouse gases when Kyoto’s caps come into force between 2008 and 2012. As a result, Russian industry has little to lose from the country’s ratification of Kyoto and the climate has little to gain.\"\r\n\r\nAmerica has a huge amount of immigration but would have to still stick to 1990 levels.  We need international agreements that work, kyoto wasn't the answer.  It's sad that we still don't have something that will work.", "Not from what I read.  They were worried about loosing workers if the ports put in mechinization.  I think it's great if they wanted the ports to pay more for the efficiency gains but that's not what they wanted.  They apposed the efficiency gains because it would mean loss of workers (read union members).", "You would be hard pressed to demonstrate that there has been a net reduction of CO2 from the kyoto protacal.  \r\n\r\nBut I agree it was the failing of the US to pull out of Kyoto without a real alternative.\r\n", "Not really, Russia hasn't reduced any of their emissions since the fall and are doing the majority of selling.  Europe’s population is declining so it only makes sense that they could reduce their CO2 emissions.  China, India, the third world all don’t have to do anything.  The companies in the EU that are producing more can just buy from Russia.", "The 2 magnets accelerate the ball to them. When it hits the energy is transferred to the last ball and since the force of the magnet isn't very strong at that distance all the energy gets transferred to it and off it goes."]}, {"mikepurvis": ["&gt; I don't understand why society has any interest at all in whether a child is sleeping alone and at what age.\r\n\r\nWell, there's interest because the article in question is advocating an approach contrary to the established norm. No one's forcing anyone to do anything, it's simply case of sound advice being made available to parents who are interested.\r\n\r\n&gt; And I can only think that if society has an expectation about it then they should take their expectation and shove it.\r\n\r\nYes, except that children who grow up in an environment devoid of expectations turn into welfare leeches on our benevolent socialist state. So you're right, it's not society's business what pace a particular child develops.\r\n\r\nBut it is society's place to propose methods to parents that won't screw up their kids.", "Does each chapter ending with a cliffhanger *make* it a waste of time, though? Is cliffhanger-ness the deciding characteristic in determining whether a book is worthwhile?\r\n\r\nI felt the book was an entertaining read. The gnostic premise, of course, is ridiculous, but it works on the level of an exciting adventure story.", "Right, but in Dan Brown's case, at least it's basically just one plot strand, plus the secondary Opus Dei/Silas one.\r\n\r\nEver read the Redwall series when you were young? Jacques would have like three or four independent plotlines going on at once, so that there was pretty much no point during the book where one of them hadn't been left hanging with something along the lines of \"And then character X turned around and staggered backward, shocked with the events were taking place.\"", "Yeah, that purity ball thing is a little creepy. I knew a anglican youth group in Toronto that held dances every once in a while; pretty much the same as a high school dance, except with a handful of parental chaperones and no liquor or limousines.", "I didn't mean to imply anything twisted, quite the contrary. I thought it was kind of cool that the group held social events that weren't just some random thing plus a Bible study.\r\n\r\nOn the other hand, the particular church I have in mind is much more evangelical (it means *Bible believing*) than [most Anglican ones in Canada]().", "Have not saints lips, and holy palmers too?\r\n\r\n*Ay, pilgrim, lips that they must use in prayer.*\r\n\r\nO, then, dear saint, let lips do what hands do;\r\nThey pray, grant thou, lest faith turn to despair.\r\n\r\n*Saints do not move, though grant for prayers' sake.*\r\n\r\nThen move not, while my prayer's effect I take.\r\nThus from my lips, by yours, my sin is purged.\r\n\r\n*Then have my lips the sin that they have took.*\r\n\r\nSin from thy lips? O trespass sweetly urged!\r\nGive me my sin again.\r\n\r\n***You kiss by the book.***", "I don't know about experts setting the *exact prices* of consumer goods, but in a free market, the consumer's biggest asset is knowledge.\r\n\r\nSo it's important to have independent regularatory bodies that \"approve\" products at varying quality/safety/durability levels. Or at least have watchdog groups that raise hell when stuff goes awry.", "In that case, just comment on it. You can get to it through your comment history, but it won't clog up your homepage. I'm more likely to comment on articles I disagree with anyways, so it works out pretty well.\r\n\r\nIf you're stuck for what to say, I recommend starting with \"OMG teh sux04r5!!@$5\" and just letting it flow from there.", "I need my MacBook, so I'm buying right away... although I'm well aware of the risks.\r\n\r\nI'm more just annoyed about the glossy screen. Some people seem to like it, but my preference is toward old-school matte ones. They seem gentler on the eyes.", "The issue there, though, is that there *still* needs to be a page people see when they first hit the site.\r\n\r\nCome hell or high water, some users would rather see the *official* reddit homepage than their custom one. By replacing it, you force users to log out if they want that option.\r\n\r\nAnd anything that encourages users to log out is a Very Bad Thing.", "I'm with you on that. The classic defense of \"but they're highly educated and non-partisan\" has always felt a little sketchy to me.\r\n\r\nThere must be more to this story than meets the eye, but it's absurd as it stands.", "Well, as an example, for my current job in an industrial setting, I was required to purchase safety footwear.\r\n\r\nIt turned out to be a really easy choice; some shoes had the CSA green patch, others didn't. I didn't need to question store personnel or check reviews or anything... I just picked the cheapest pair that were certified, and that was it.", "Clearly, the fantasy sports leagues should just present every player's name in pig latin.\r\n\r\nThe savvy ones can write a bookmarklet to correct them client-side.\r\n\r\nAnd everyone else, well hey, it's pig-latin.", "I'm not too big on your languages rant, but the rest of the first half of your comment deserves an upmod.\r\n\r\nI realise that the Google people have accomplished something pretty incredible with GMail, so I'm cautious about pooh-pooh-ing this. Plus, of course, the most recent Rails version adds a similar sort of Ruby-&gt;JS converter.\r\n\r\nMy concern is more about how you debug such a thing. Javascript is a strange beast... when the generated code isn't doing what you want, it could be a real disaster dipping into it to figure out what went wrong.", "&gt; 30 kph signs on many large roads\r\n\r\nThe residential neighbourhood I live in has a posted limit of 40 kph. The city has a default limit of 50 kph, and most inner-city arteries have it posted at 60.\r\n\r\nStill, according to the article, they're raising them to 80. That's pretty swift. I remember getting annoyed in PA at all the 55 roads, but 80? Yikes...", "80 miles per hour? That's nearly 130 kph!\r\n\r\nThe highways in Ontario are all either 90 or 100. It's only the quickest lanes where people go 125+. I can't really picture 130 being the baseline from which people speed. (that is, unless the speeding penalty is extraordinarly harsh, like lose-your-license harsh...)", "Sort of depends where RIM's servers are. If it's as bad as you say, then my money's on RIM keeping on all the infrastructure state-side.\r\n\r\nWhich means that a Blackberry-&gt;local email will probably be compromised, but a Blackberry-&gt;international or Blackberry-Blackberry email is completely secure.", "&gt; Live by the DoS, die by the DoS\r\n\r\nYou know, honestly, I have really mixed feelings about this whole thing.\r\n\r\nIt's got to be incredibly disheartening to the people at Blue... because in the end, *the strategy was working.* By installing the software, users were saying \"no\" to spam, and that software was simply acting as their proxy in filling out the multitude of opt-outs. (unless I grossly misunderstand what the software did)\r\n\r\nThe fact that spammers retaliated like this against them and their customers is all the more damning to their claims of being legitimate businesses.", "I still think that automating the opt-out process is perfectly legitimate. The number of opt-outs they get flooded with is simply a function of many unwanted emails they send.\r\n\r\nThe issue here was that the ones leading the charge were an easy target, and there was a lot of collateral damage in harm to bystanders/users.\r\n\r\nWhat really needs to happen is the same thing again, but from a more nebulous, unassailable source. (like, for example, a sf.net open-source project...) And without the extortion and threatening. If they want to stop receiving the opt-outs, they can figure out how to automate the process of removing the opt-ed-out users.\r\n\r\n**addendum:** I'm amazed reading the [John Levine article]() linked below... does he really believe that what Blug Frog did represented a malicious attack? Especially when compared with the spammer's threats?\r\n\r\n&gt;Its simple, we dont want to, but BlueSecurity is forcing us. We would much rather not waste our resources and send you these useless mails, but do not believe for one second that we will stop this tirade of emails if you choose to stay with BlueSecurity.\r\n\r\n*Ouch*.", "This looks interesting. If he wants to find the squirmy bits, though, he could just skip on ahead to Noah's vineyard, Jephthah's daughter, the slaughtering of the Canaanites, the Song of Solomon, etc.\r\n\r\nAnyhow, I predict that he gets mired in Leviticus. It's where everyone else gives up."], "Fountainhead": ["Money doesn't improve schools.  I dare you to find ANY study that correlates money to better education.  In my high school we had $300,000 worth of computer equiptment.  Do you know how much it helped me?  Not one damn bit because the software sucked and the teachers couldn't figure out how to use it.  You know what did help?  One of my teachers got a $1000 grant to get a computer with some nifty video editing software.  It was used pretty much 10 hours a day every school day.  It doesn't take money it takes creative teachers and administrators with the ability to try new ideas.  Thanks to the teachers union and idiotic state control there is no change in school.  Schools are just getting worse.", "You know when you argue about money \"being taken away\" you prove why the current school system is broken.  Schools get paid based on how many students attend.  Schools have to deal with students coming and going.  Schools have to hire and fire people based on how many students they need to teach.  If they can't teach 100 students for $100,000  they are not going to be able to teach 80 students for $80,000.  Plus schools have a problem with lack of space, having a charter school allows schools to have more room.", "My point is that lots of ideas are plausible but very few can be backed up with facts and substance.  I get frustrated reading \"plausible\" stories that totally disregard the evidence.  I participate in evolution/creationism debates and it is very similar.  Sure they are both plausible theories but one has a mountain of pear reviewed research to back it up.   I know, I know you’re going to say “but there are a lot of things that don’t make sense”…  It’s the same thing I hear from the creationists.   I don’t mind that there are people asking questions, the government could release more details as well as tapes.  I have a problem with people buying into crap because “that sounds plausible”.", "I agree that higher education isn't a free market as it's heavily subsidized by the state and that my tax money goes to the state school regardless if my kids or I end up going there.  I would rather have a trust set up so that I might choose were to send the money.   But it is a whole lot closer to a free market than k-12.   \r\n\r\nThe point is that there is competition to get students in our university system.  I don’t know about you but I looked at about 12 engineering schools before I picked the one I went to.  I had 3 choices of schools growing up and they all sucked, it’s just that 1 was 10 miles closer than the other two.  Ideally there would have been 10 smaller high schools with advantages and disadvantages that I and my parents could have picked from.", "I think that's a step in the right direction but why not break it down further.  Say Celia's family likes the public school and what they are trying to do and John likes the local charter school.  Why not let them both decide where the money goes by sending their kids to the school of their choice?    I don’t think there is one right way and that’s what we currently have.  We have one big public school system where everyone learns exactly the same.  This is BS no one learns the same.  We need to have lots of little schools catering to the needs of the students and parents not to a school board and the teachers union.", "So I'll bite.  What incredible evidence do you have to refute the official list of 911 hijackers?  BTW please don’t say something as moronic as “some of them are still alive” or “they weren’t on the passenger manifest” because it only took me 5 minutes to figure out why those arguments are retarded.", "I can start with all the information here:\r\n\r\nIn fact the whole of this is pretty good \r\nThere are others but that is a good rundown of at least 3.  \r\n\r\nSo you might say \"but what about them not being on the passenger manifest?\"  They aren't on most of the ones the press has because most of the press took them out so that the terrorist’s names and victim names were not mixed.  \r\n\r\nYou might say \"but some of the 'terrorists' are still alive\"  This is because there are many people with the same name,  I know of 12 people in America with my same name.  After 9/11 the FBI released names without pictures, a bunch of people called in saying it wasn't me.  They later put pictures with the names and the problem went away.  \r\n\r\nDid I miss something?  Please enlighten me.\r\n", "They usually are held accountable to their sponsor—a local school board, state education agency, university, or other entity.  If they don't live up to thier charter then they get shut down.  True that the agency often isn't elected, but the end goal is education.  Don't get me wrong, I still think we have to have state standards that an elected body decides upon.  \r\n\r\nI'm having a hard time understanding why you use the term \"leech\"  Sure if the kid was going to public school they would get more money.  But then they would have to teach another kid, that costs money.  It's kind of like saying that when people move to a new school district they are \"leeching\" off the old one by not going to it.", "The fact that he also had national guard get stuff out of his house while people were starving and dying doesn't paint to good a light on the guy.  I'm just saying that people should hold off judgement till he has had a chance to respond.  People are innocent till proven guilty.  Who knows maybe the bush administration set this all up to have some finger pointing (doubtful)", "So you accidently kill a few hundred bugs?  Do you wince everytime you accidently hit a one?  Do you drive 5 mph to minimize the risk?  Do you do anything to minimize the risk of hitting bugs on your way to the store?", "Yea, it disturbs me too and I'm not sure why.  I don't feel bad in other circumstances.  I wonder if the guy felt bad on that first pour?  I bet he didn’t feel bad on the second pour, especially after having to dig out 9 feet of earth.  \r\n\r\nI wonder how many bugs we kill in an average day?  I bet it’s in the thousands.\r\n", "Are the republicans really arguing that the FBI should have no right to gather evidence?  Screw that.  Seems like if a law was violated it should be investigated, if that includes the congressional office so be it.  They got a search warrant.  I'm sick of congress making special rules for themselves.", "I enjoyed mathking's comment as well, however the main point still holds. Our education system is not working well. At least John Stossel is trying to bring it to the forefront. What I really wanted to see from Mathking is what he thought we should do. I still have not seen a good argument against vouchers.", "I totally agree with your points.  But I think there can be solutions.  For example like you said, requiring schools to take everyone, or another solution might be to give schools additional grant moneys if they are willing to take handicapped or disabled students. \r\n\r\nIdeally I see many different schools specializing in areas that meet different needs.  I don't think one type of school is capable of getting everyone to their fullest potential.\r\n", "I wouldn't even call it a disaster, it's just broken, there are plenty of good school, unfortunately there are a lot of bad ones that under the current system will never become better.  I agree with your points, but it seems the only way to get people to start talking about education in any kind of meaningful way is to have knee-jerk ideological positions so you open up dialog.\r\n\r\nIn almost every education discussion I have people tend to defend the status quo and ask for more money.  It's been like this for almost 30 years. 30 years.  30 years!  It's time to start really focusing on what will improve schools.  If it is money we need to address how to get it, because currently bonds and taxes aren't going to do it, otherwise they would have already.   \r\n", "I can't agree with you and jmassey more but it seems to me the logical solution would be to have a voucher system were you could be decide where to go.  Granted you might have to pay a little more but you had to pay to go to college too.  What we need is more diversity.  We need schools specialized in taking care of special needs kids, schools specializing in English assistance, schools for smart kids, schools for kids with reaction problems.  Throwing them all in the same school helps no one.  The only kids that have some small choice are rich kids.  If fostering an elitist society is our goal, we have it.", "The only concrete activity anyone can do is to actively engage people with information and discussion.  Simply, you need to convince people.  Spending a million dollars on some TV ads or brochures only changes the minds of the week minded.  You need to convince people of your position and get them motivated to vote and give money to politicians they believe in.  This happens one person at a time.", "What do you accomplish with a protest anyway?  Back in the 60s it was a way to provide and disperse information.  Protesting today is a social party put on by a bunch of people that want to feel better about themselves.  If you want to make a difference contribute to a candidate you believe in and vote.  Convince others of your position and give them information.", "1. There is no draft.\r\n2. The democrats don't offer a valid alternative.\r\n3. We have been screwed in the past by organizations like green peace and would rather not act like them.\r\n4. Protesting only works in France, here we have to monetarily support our candidates and vote.\r\n5. Most people that would be protesting in the 60s are flaming each other on reddit.  (which I might ad is far more productive)\r\n", "I grew up in a town of 20,000 and we had 5 schools.  1 public, 1 alternitive, 1 charter, 1 catholic, 1 religious (i don't remember the denomiation)  we also had a homeschool comunity.  None were very big and all were in a 2 mile radius.  They don't have to be that big to work.  Some didn't cover all the grades but you can see that diverisity is possible we just have to be open to it."]}, {"mikepurvis": ["&gt; ... but I would be pleased to see the precedent set of a female President.\r\n\r\nAnd this decision represents a \"values vote\" how? Does your female candidate have policies that you agree with?\r\n\r\n(I'm not trying to slag Hillary or the notion of a woman president, but if her gender is your deciding factor, then maybe it'd be better to stay home on election day.)", "But the solution to that, from the lay-person's perspective, is not to go ahead and vote in minority candidates for their own sake.\r\n\r\nIt's kind of like post-secondary institutions that have different entrance grade levels depending on race, in order to keep the minority levels proportional to the population at large... it's treating the symptom instead of the cause.", "What would it take for me to try Smalltalk? An online documentation resource as extensive as [this one]().\r\n\r\nPHP may be the uncool older brother to all this new stuff, but there's no screwing around with conflicting libraries because *everything you need is already right there*. And it's all completely and accurately documented, including mountains of useful published feedback from users.", "That's really cool to see. It's amazing being out on the freeway and realising just how much prime real estate is being taken up just so we can drive on it.\r\n\r\nKind of makes you wonder if future systems of transportation (personal flight, automated traffic control, underground networks, etc...) will one day allow some of that land to be reclaimed in the same way.", "You're absolutely right about it being a different kind of market. The other interesting thing about phones (as compared to Blackberry/PDA) is that the system is *set up* so that it's  much easier for content providers to charge for content rather than give it away.\r\n\r\nThere was tons of great free/shareware stuff for Palm OS, but there will never be an OSS community around phones. JC talks more about [the limitations of cell development here]().", "Only in some cases. The [cassette tape]() is basically open (free license), and yet how many new stereos still include a tape deck? What about personal listening devices, or audio systems in cars?\r\n\r\n", "The key with Reddit, though, is to go beyond just \"cross-site\" ads... all that click data that they've got that they're not using could become very valuable very quickly.\r\n\r\nRather than just mapping stories to users with similar tastes, they should be mapping ads that have been clicked on to other users likely to click on them.\r\n\r\nI've clicked on more ads in my GMail than the rest of my web surfing life put together. Because the matches are directly related to the topics of my emails and therefore of interest to me.", "The next step, of course, is for fans to sponsor the continued development of dumped shows.\r\n\r\nI always thought it would make an amazing story if some inordinately rich individual could \"bribe\" a television network into keeping a particular show. For cult-appeal programmes like Firefly and Arrested Development, they could have the regular run of advertising material, but with an extra five-second spot thanking their benefactor, ______________.", "I'm not sure it's quite fair to simply average the pixels in the images themselves. For starters, you end up with silky-smooth skin, since any blemish is lost in the machine.\r\n\r\nBut besides that, how do you \"average\" something like the shape of the face? A long face ([Sarah Jessica Parker]()) and a round face ([Helena Bonham Carter]()) should average to some standard oval shape, but the only way this process acheives that result is when enough of the faces \"agree\" that it washes away the outliers.\r\n\r\nNevertheless, it's a neat experiment. And if this was indeed his method for creating them, a good job was done on lining up the features. (as opposed to [50 people see](), where there's zero pre-processing...)", "It seems to me that relying on secrecy of the server locations is kind of a flimsy approach.\r\n\r\nI love what they're trying to do, and I can't think of anything better off the top of my head, but I worry when the main defense is that \"they don't know where it is.\"", "There are a lot of problem domains that are simply not covered by open formats, though. (Example: legacy Autocad drawings...)\r\n\r\nEven open formats can lose support over time. Take, for example, PCX. This may eem trivial, but all those 320x200 resolution PCXes were designed to be viewed on a monitor with a non-square pixel ratio. Without using Photoshop or some other image manipulation tool, it's impossible to view the work of old pixel painters in the correct aspect ratio.\r\n\r\nIt's not impossible, it's just a pain. Like the cassette tape, the format can still be viewed; its contents enjoyed. But I still maintain that a loss in *convenience* will ultimately lead to a loss of the content itself.", "It's strange that they out-sourced the ad feed to this \"AdBrite\" company, though. I think that's coming awfully close to [confusing the box with the chocolates]().\r\n\r\nAs you've said, the Reddit guys have an opportunity to do some really unique stuff with their advertising... I hope that using \"the Internet's Ad Marketplace\" doesn't prevent them from being innovative.", "I'm with you on that. I wouldn't mind people having their very young kids (or farm animals) around; at my last workplace, two of the dev pit guys brought their dogs.\r\n\r\nBut if there was any hollering or barking or whatever, that would be the end of it.", "That's actually really practical, if a little buzzwordy.\r\n\r\nKind of reminds of the URI/URL distinction. I realise that they are indeed separate concepts, but I've always felt vaguely resentful toward \"URI,\" like it was some term invented arbitrarily by a consultant somewhere.", "It's kind of funny that you should say that, because it's absolutely true that communities like Reddit and Digg breed an approval dependency.\r\n\r\nEspecially when the sum of your value to the community can be encapsulated in a single integer number. Part of me's quite glad that comment scores don't count toward overall karma; I think my \"controversial\" comments are on the whole much more interesting and important than the ones that were overwhelmingly agreed-with.", "&gt; I also realized that High School was a joke. It was more about following the rules than actually 'learning'.\r\n\r\nI sort of came to the conclusion (in Canada) that past about grade 6 or 7, public education is more about developing as a person than learning academically. I mean really, given high quality instruction, the entirety of high school mathematics could probably be compressed into a highly intense two-week seminar. Ditto for physics and chemistry...\r\n\r\nAs for history, geography, and literature, well, I retained embarassingly little from those, but I do remember enjoying the classes. That suggests to me that what I enjoyed was not so much the material itself, but the opportunity to interact with my peers over it.\r\n\r\nEither that, or [PG is right](): \"...they didn't want to have too much to do with the kids. Like prison wardens, the teachers mostly left us to ourselves. And, like prisoners, the culture we created was barbaric.\"", "I dunno about three whole hours, but that's along the lines of what I do. The [basic dough recipe from pizzaware]() is pretty good.\r\n\r\nThe parent is right about the cheese though. With homemade pizza, three quarters of the cost is just the cheese.", "Definitely, yeah. The [burglar alarm]() has that *hey cool* factor, but not so much use in the everyday.\r\n\r\nedit: Just got this working on my new MacBook. Totally sweet. :)", "I agree. I feel extreme skepticism when their main point to bash the book on is Brown's word choices. It's true that the DVC narrative does more showing than telling, but it's also an action book, not the next Jane Austen.\r\n\r\nI do, however, agree with the reviewer's point that the film's shortcomings will help get people to stop taking the book so seriously. I got so fed up last year with people people pompously telling me that they found the book \"really interesting,\" and about how it \"really changed their perspective on the Church.\"", "&gt; I really don't think I want to become whatever type of person high school is trying to develop me into.\r\n\r\nIt's probably a good thing that the majority of high school development programs are bogus. \"Civics and Careers\" was basically just a propaganda course... it would be kind of scary if people actually took that stuff seriously.\r\n\r\nBut the fact remains that those years (14-20) are incredibly important for personal development. Whether or not they influenced you in the ways they meant to, high school does have a profound impact on a person.", "I'm modding you up because I think you're being deeply sarcastic... between quitting and succeeding, there aren't really any other options.\r\n\r\nKind of like how you always find it in the last place you look...", "I guess I think of it as more obvious because of the related words. For example, I just think of ascend, descend, ascent, and descent as all being related to crescent. And *crescent* would look really really weird with anything other than *sc* in the middle.\r\n\r\nAs for *dissent*, well, that's related to *dissident*, which couldn't be spelled any other way than with the double s.", "I did almost the same thing for a cross-sum solver in high school, except mine was written in Turbo Pascal. We got bonus marks in Calculus for handing them in, and I got sick of doing them manually.\r\n\r\nBut yeah, that logic solver plus recursive brute force is pretty much the best way to go.", "I'm with you on that. Alternative title: \"Scientists discover that people who believe in science are smarter than people who don't!\"\r\n\r\n(which, of course, introduces that other nasty debate about whether religion and science are mutually exclusive... which itself seems like little more than an attempt by foaming-at-the-mouth naturalistics to discredit the rest of us.)", "&gt; Have you ever thought that their pathetic, painful lives might be best left unlived?\r\n\r\nInteresting... that's the same argument made by much of the pro-choice camp.\r\n\r\nI'm not sure what conclusion there is to draw there; I just noticed the parallel.", "Oh okay... I hear it all the time applied to teen mothers or others in lower-income situations where the child would \"be better off not growing up.\"\r\n\r\nThe difficulty with the position is that you end up with a far greater proportion of [black babies aborted]() than any other racial group.", "Right, but I meant in terms of Democrats and Republicans hurling mud at each other. If both are guilty, then we (and by that, I mean the non-US reddit population) can stop hearing all the time about how party X initiated freaky program Y.", "He's right on the mark about staying busy. Having a lot of commitments is great for several reasons:\r\n\r\n- it generally gets you in work/busy-mode, and\r\n- it makes you work *now*, knowing that you have commitments later on.\r\n\r\nI think the real key is to keep the activities varied. Do something sporty, something musical, something technical, etc.\r\n\r\n(For me, it's swing dancing, piano playing, and LEGO Mindstorms, on top of my web-dev related hobbies like blogging and so-on.)", "I find campus banter is a bit like this, too. Going back to being with family and non-university friends, I have to halve the speed, double the volume, and remember that the listeners probably *won't* assume a sentence finish and barge in partway through.", "It's worth glancing at the comments there as well.\r\n\r\nI feel torn. If the exhibit was as tasteless as comment #3 makes it out to be, then yeah, it probably should never have been posted... not because of religious pressure, but because it's not artistic.\r\n\r\nOn the other hand, I detest the notion (as said in the article) that an establishment such as an art gallery can be made to bend to a handful of folks with \"hurt feelings.\"", "It's worth mentioning that they don't even have *licenses*. And it's additionally surprising that they can do it in a suburb.\r\n\r\nIn the city, it's easy because of public transit. And in a small town, it's easy because everything is close by. But I'm not sure if I could stomach a 17.5-mile bicycle ride to work every single morning, and then home again every night. That's seriously intense.\r\n\r\nSeriously, though, it's reckless that their kids aren't even getting their licenses. Knowing how to control a motor vehicle is an important skill... when they want to go camping, what do they do, take a taxi? You can't even a rent or lease without a license!", "I find your entire comment completely confusing, and a little bit scary.\r\n\r\nWhat is your proposed alternative to locking away paedophiles? Are we to let them roam free while they try to sort out their \"uncurable mental illness\" all on their own? Are they to be given infinite leeway because they're fundamentally not responsible for their actions?\r\n\r\nChildren are the future; to be protective of them is a trait deeply ingrained in every human being. Excuse me while I fetch my pitchfork.", "I had assumed that \"having molested a kid\" was how they were exposed. Obviously the point is not to prosecute based on alleged thoughts; such a thing is absurd.\r\n\r\nI'm still not quite feeling the main point of your argument though. It sounds like you're making a distinction between \"feeling sexual attraction toward children\" and \"engaging in sexual acts with children.\" I realise that for the purposes of enforcing the law, you only prosecute actions... but what's with this bigotry stuff? Am I supposed to celebrate Joe's unrequited sexual love for my child in same way that I celebrate the sexual love that my gay neighbours feel for each other?", "I agree. This is really the epitome of a good design. Indeed, an example of [realigning over redesigning](): Maintaining the brand while freshening the experience.\r\n\r\nTo be honest, the site it reminds me the most of is actually [Newsvine]().", "&gt; You don't celebrate it, you put up with it.\r\n\r\nRight, but am I not then a \"bigot\" in Morlock's book? I still don't really follow his logic. I think [chu is picking up on the same thing](), although he's said it more eloquently.\r\n\r\nBy *merely* tolerating this hypothetical non-rapist paedophile, and by keeping my hypothetical child far far away, am I not causing him the kind of angst that Morlock alleges will \"push him over the edge\"?", "A simple Greasemonkey script can accomplish all of this.\r\n\r\nHowever, I do agree that Reddit's reliance on nested tables borders on the ridiculous. It would take about two seconds to convert it to either a nested OL structure (semantically correct) or a series of straight-up DIVs with a simple class indicating their indentation level. (very fast to render)\r\n\r\nBut as it is, it's [no wonder browsers have trouble with crap markup like this]().", "The pre-FF1.5 mouse gestures extension used this same trick. It seems crazy, but it does the job. :)\r\n\r\nOne thing they should change, though: Use a 1px border (instead of background) to give each pixel its colour. When you print a page, borders will show up--backgrounds won't.", "So you're right. I only took a quick peek at the DOM inspector before, but a closer look reveals that they are all level.\r\n\r\nPerhaps it's that the page includes a hidden form for every single comment? It would certainly be quick to just have a single form that gets node.attachChild-ed to the relevant comment upon replying...", "I think generally, the OT law teaches salvation by works, whereas Jesus is more about salvation by grace.\r\n\r\nThe passage being discussed about is likely [this one](;version=31;):\r\n\r\n&gt; Do not think that I have come to abolish the Law or the Prophets; I have not come to abolish them but to fulfill them. I tell you the truth, until heaven and earth disappear, not the smallest letter, not the least stroke of a pen, will by any means disappear from the Law until everything is accomplished. Anyone who breaks one of the least of these commandments and teaches others to do the same will be called least in the kingdom of heaven, but whoever practices and teaches these commands will be called great in the kingdom of heaven. For I tell you that unless your righteousness surpasses that of the Pharisees and the teachers of the law, you will certainly not enter the kingdom of heaven.\r\n\r\nBut it's important to look at it in the context of other passages, such as [Mark 7](;version=31):\r\n\r\n&gt; \"You have let go of the commands of God and are holding on to the traditions of men.\"\r\n&gt;\r\n&gt; And he said to them: \"You have a fine way of setting aside the commands of God in order to observe your own traditions! For Moses said, 'Honor your father and your mother,' and, 'Anyone who curses his father or mother must be put to death.' But you say that if a man says to his father or mother: 'Whatever help you might otherwise have received from me is Corban' (that is, a gift devoted to God), then you no longer let him do anything for his father or mother. Thus you nullify the word of God by your tradition that you have handed down. And you do many things like that.\"\r\n&gt;\r\n&gt; Again Jesus called the crowd to him and said, \"Listen to me, everyone, and understand this. Nothing outside a man can make him 'unclean' by going into him. Rather, it is what comes out of a man that makes him 'unclean.' \"\r\n&gt;\r\n&gt; After he had left the crowd and entered the house, his disciples asked him about this parable. \"Are you so dull?\" he asked. \"Don't you see that nothing that enters a man from the outside can make him 'unclean'? For it doesn't go into his heart but into his stomach, and then out of his body.\" (In saying this, Jesus declared all foods \"clean.\")", "Well, at that point it really depends who you talk to. The concept that God's plan actually *changed* is called [dispensationalism](), and it's one of the many theological disagreements that denominations take their own positions on.\r\n\r\nWhat *is* obvious, at any rate, is that Jesus was very critical of the Pharisees attempting to build up their own traditions on top of Moses' OT law.", "I don't think I'd ever buy something as major as a house on a loan that isn't at least partially fixed.\r\n\r\nI'd spend all my time in bed lying awake worrying that interest rates would go up and I'd be completely ruined.", "I think it's a valid article. Part of the reason that it's important for (married) couples to be really open with each other about their expenditures. I know current fashions dictate having separate bank accounts, but I think sharing one really forces accountability.", "I'm \"religious right\" and not totally thrilled at being called a thick-skulled moron. Nevertheless, I'm modding you up for this:\r\n\r\n&gt;This is why the seperation of church and state was established. It was not to promote atheism, although one certainly has a right to be an atheist. Rather, it was more to protect religion from the corrupting influence of politics.\r\n\r\nNot many realise this; the popular assumption seems to be that church-state separation was invented in order to kick the Catholics out of government positions in Europe.\r\n\r\nCuriously enough, the idea that political and religious leadership should be separated is present even in the Old Testament: [King Saul is severely rebuked for offering the sacrifice that the prophet Samuel should have offered](;&amp;version=31;). (Contrast this with the pagan religions; I believe in Egypt, for example, the Pharaoh was considered to be divine...)", "I'm skeptical about running it entirely off Ethernet power. Might be okay for the first one or two, but what about when you plug a big hub into your poor little four-port Linksys?\r\n\r\nI don't know all that much about Ethernet technology, but running 20+ of these devices on the same network seems to me like it would draw much more current than a typical router is used to providing. (EDIT: Having looked at [their marketing materials](), it seems that you do need to use special networking equipment that provides [power over ethernet]())\r\n\r\nBut yeah, 64 MB of flash is enough to install some kind of virtual desktop system to run apps and data off a central server. Sounds sweet, if you ask me.", "Number 9 was previously [covered by Damn Interesting]() and subsequently [discussed here]().\r\n\r\nDI's take on the story, however, was to laud the responsibility of the designer, for coming forward when he realised the mistake", "That's an interesting analysis, thanks.\r\n\r\nI guess the real key then is, when renting, to acknowledge the savings and be actively purchasing \"real\" investments in lieu of buying a house.\r\n\r\nThe trouble with renting is that it appears as though you've got all this extra cash flow to just spend on beer and popcorn.", "According to the broshure I linked, it is indeed designed to run entirely from Ethernet power, with no alternative provided. You take the faceplate off the receptacle box, hook up the CAT5 directly, and then insert the computer into the box so that it's almost flush with the wall.\r\n\r\nThe pictures in the original story don't quite convey this concept.", "Improv Everywhere have done [tons of amazing missions](), but I think this is one of my favourites. I just love their positive, upbeat outlook on comedy:\r\n\r\n&gt; **Why do you do this?**\r\n&gt;\r\n&gt; Improv Everywhere is, at its core, about having fun.  We're big believers in \"organized fun\".  In the process we bring excitement to otherwise unexciting locales and give strangers a story they can tell for the rest of their lives.  We're out to prove that a prank doesn't have to involve humiliation or embarrassment; it can simply be about making someone laugh, smile, or stop to notice the world around them.", "The Best Gig Ever case is a little weird... initially, the band said they were [totally cool with it](), but the *This American Life* radio segment later on indicated that both the Ghosts of Pasha guitarist and Chris (the Ted's Birthday target) were unhappy.\r\n\r\nNevertheless, IE's response seems [balanced and reasonable](). I think they acted in good faith on both occasions, and as they point out, those are some of the only missions involving specific targets. The taxicab one, of course, targets the driver, and has a similar suspended-reality flavour to it.\r\n\r\nUltimately, they can't predict everyone's reaction. But I think in 99% of cases, the people walk away with a great story to tell... even if it was all a setup.", "I wouldn't worry too much about it. What he's describing here are not standards, just another way for savvy html/css developers to pat each other on the back. It's like Sneetches with stars... I should know, I'm clearly a Level 5.\r\n\r\nStandards *are* important, of course. Lobbying by groups like W3C and WaSP are the only reason the current browser market is as sane as it is. But if you have no idea what a guy like Roger is talking about, don't sweat it. (Unless you're a Level 3, in which case you should get with the programme, dude.)", "&gt; **Dino 1:** Everything looks good from here. Yes... Yes.. This is a fertile land and we will thrive. We will rule over all this land and we will call it.... This Land.\r\n&gt;\r\n&gt; **Dino 2:** I think we should call it your grave!\r\n&gt;\r\n&gt; **Dino 1:** Ah, curse your sudden but inevitable betrayal!\r\n&gt;\r\n&gt; **Dino 2:** Haha, mine is an evil laugh, now die!\r\n&gt;\r\n&gt; **Dino 1:** Ahh, no dear God. Oh, dear god in heaven.\r\n&gt;\r\n&gt;*sirens start blaring as Wash stares to a radar console*\r\n&gt;\r\n&gt;**Wash:** Oh, mother, son of a b..... \r\n\r\n(I couldn't decide if I wanted to make a Firefly, Monty Python, or Family Guy reference... they're all just so good.)", "Because to avoid looking foolish, they try to avoid printing stories that are too far off the beaten track. For an example of why conservative reportage is a good idea, see [this debacle](;k=38945).\r\n\r\nThe last thing a major news organization wants is to print some highly-inflammatory piece about an administration (claiming a fixed election, calling for impeachment, etc.) and then wake up the next morning to find out that there's nothing to it but a bunch of smoke and bad intel.\r\n\r\nBloggers report this stuff because they have--by and large--no reputation to uphold, and thus nothing to lose.", "I remember enjoying the [Sword of Truth]() books in high school. The best one of the lot (by far) was the sixth... the one following it was a disappointment and I didn't pursue the series beyond that.\r\n\r\nI tried Wheel of Time briefly, but the two were very similar and I found Goodkind's characters of Richard and Kahlan to be more interesting and memorable.", "It's interesting because the ham half of the TREC 05 set is mostly composed of Enron employee emails that were released to the public during the course of the investigation.\r\n\r\nDetails here: [PDF]()\r\n\r\nRemember kids, don't use your company email address to flirt with your girlfriend...", "I lost interest after this:\r\n\r\n&gt; Their impact on wages is irrelevant compared to congress’s refusal to raise the minimum wage...\r\n\r\nI have trouble listening long to a person who believes that the poor are helped (and not seriously hurt) by legally enforced overvaluing of unskilled labour.", "I can sort of picture that, if there are male kitchen staff or whatever.\r\n\r\nReminds of driving around the lake to pick up my sisters from Girls Camp a few summers ago. According to them, the staff got pretty used to being in an all-female environment... it took them extra effort to remember to wear a towel to the showers on visitor day.", "&gt; The first [force working against them] is economic—exemplified by the number of big American companies that now prefer to operate from low-rise campuses built outside cities. There are of course exceptions. These tend to be large financial institutions, on which a skyscraper confers the permanence once embodied by marble halls and oak-panelled dining-rooms.\r\n\r\nThere's definitely an appeal to being outside the city: Your people can live close by for cheaper, and they can step outside for lunch without burning twenty minutes of it on elevator rides and revolving doors.\r\n\r\nOn the other hand if, as the article suggests, there will be an excess of downtown highrise space, perhaps it will become economical for some types of software companies to move back there. Being in the city has advantages for entertaining clients and being closer to competitors.\r\n\r\nI continue to be intrigued by the [advances in elevator technology]() that make greater heights possible from a practical standpoint.", "It's the same grain of salt you have to take when observing literacy statistics and government testing scores. Half the time the wild fluctuations are simply bureaucrats twisting their dials and switches.\r\n\r\nOr--whether by accident or on purpose--the government offices that oversee social support simply publish the kinds of numbers that will get them the best funding under the current administration.", "I found this a really intriguing piece. It's like something out of the Truman Show.\r\n\r\n&gt; Lynn Picard, the executive vice president of Lifetime Television, said the Perfectmatch integration would be more natural than some previous situations. \"This is probably one of the best examples of a truly organic integration,\" she said.\r\n&gt;\r\n&gt; ...\r\n&gt;\r\n&gt; Throughout the episodes filmed so far, Perfectmatch is generally presented as the impeccable rival of Lovespring, but it takes an insult or two — at one point, Perfectmatch is called \"a hack\" by a Lovespring employee.\r\n\r\nBrilliant, if you ask me. I wonder if a show like *The Loop* could do this sort of thing... in the make-believe airline that's obviously circling the drain, have the executives constantly mentioning the cushy features of real-life airline X that has it all together.", "He said he was below 1.33 x poverty. If the poverty line is indeed $19.4k, then he's saying that he's at about $26k.\r\n\r\nThe 25% drop was *to* $19.4, not *from* $19.4.\r\n\r\nEither way, he's obviously fiscally responsible and has his family's cashflow under control. Which is more than can be said for a lot of households.", "I'm terrified that it's a parody and I'll look retarded for posting this.\r\n\r\n&gt; With storyboards, you can do that. You can previsualise your movie and draw them out, but what you should really do is make a blank screen for yourself and watch your movie. Close your eyes and stare at this.\r\n\r\nI'm a pretty observant movie-goer, but in my limited experience trying to shoot and cut together my own scenes, I had a lot of trouble getting it to \"feel right.\"\r\n\r\nI have this suspicion that it's best to at least know the rules, even if you intend to break them. Knowing what side of a conversation to film, when to go wide or close, how often to cut, etc.\r\n\r\nI realise that some rules, like *film in front of a bright window and everything will be a silouette* are obvious after the first infraction. But other such guidelines are non-obvious, but will feel strange when unknowingly and repeatedly violated.\r\n\r\nDon't get me wrong... the entrepreneurial spirit of the piece is nice. I just don't think folks should assume they can be the next Tarantino just because they thumbed their nose at film school.", "This bit right here is the key:\r\n\r\n&gt; Strict mothers were nearly five times more likely to raise tubby first-graders than mothers who treated their children with flexibility and respect while **also setting clear rules**.\r\n\r\nWe're not comparing *overly strict* to *completely laisez-faire*, we're comparing it to *flexible and balanced*.\r\n\r\nWhen you frame the discussion that way, there's only one correct answer.", "I've used both, but neither in a high-load environment. So I can't speak to the assertions of MySQL being that much faster.\r\n\r\nFor something like Rails, where the DB is being used only as storage, MySQL is the logical choice.\r\n\r\nFor PHP apps, and other situations where you might want various data protection schemes at the DB level, PostgreSQL offers more. (and has had the features for longer...)", "&gt; \"Documentation is somewhat poor. It's still buggy at times...\"\r\n\r\nI agree that she seems to mix Ruby and Rails, but it seems clear that this particular complaint is levelled at Rails.\r\n\r\nWhich I completely agree with. The number of axioms in Ruby is pretty contained, but for Rails, it would help to have the [ActiveRecord references]() a little better organized. (It's a bit scary when one of the most helpful references is a single-sided [cheat sheet]())", "This doesn't scale to many categories and many items.\r\n\r\nIt's cute that it works when you only have a handful of categories, but in the more typical usage pattern of many categories and many items, where it's typically just one or two categories per item, the look-up table is the far superior method.\r\n\r\nI still maintain that there's a bright future for [XML DBs]()... in an XML document, doing things like multiple tags/categories per element becomes trivial--you just need a constraint mechanism that allows you to enforce rules like \"no putting &lt;cat&gt;x&lt;/cat&gt; inside &lt;article&gt;&lt;/article&gt; if X doesn't already exist inside &lt;cat-list&gt;&lt;/catlist&gt;.\"", "Yeah, the whole thing comes across as kind of sketch, in my opinion. I love this:\r\n\r\n&gt;Never attempt to learn this without two trained people who can support your falls.\r\n\r\nEspecially how it comes in a discrete \"warning\" section *following* an article obviously intended to explain in detail to the untrained how to perform the move. (And the instructions for correct spotting are off on a separate page somewhere...)", "The original episode that this sketch is clipped from is #14, inside [this torrent](). It's fascinating to watch it in context, because they tend to run together several sketches rather than always doing hard cuts the way a modern show (SNL, MadTV) would.\r\n\r\nPlus, it was public broadcast, so there are no commercials, either: The show is exactly 30 minutes long.\r\n\r\nAnyhow, I bring it up just because in the shop at the beginning, you're seeing the tail end of a funny sketch where the man standing there is using every possible euphemism to try to try to purchase pornography from the shopkeep, but he's being misunderstood each time. (Oh, you want a chest and drawers, eh?) And then all the men lined up outside on the street is the payoff from an earlier gag about appliance repairmen.", "Most of these are the kinds of names a person adopts as a nick, if their personality suits it. And most of his complaints have to do with the kid's surname, anyways. Carol, for example, if he really wanted to use it, could be combined with another innocuous name: Carol-Anne Ng, Carol-Marie Ng, Carol-Jane Ng, etc.\r\n\r\nAnd there's nothing wrong with Penelope; it's a great name, as is Penny.", "I get annoyed by this nonsense too, but my issue is more with *causes*.\r\n\r\nIf they want to sit around and spends someone's research budget inventing a pretentious new name for road rage, then that's fine. But I don't want to hear about how it's a *treatable genetic condition* or whatever. The so-called \"disorder\" is not some isolated bug that can be fixed with a few dietary supplements... it's shorthand for the long series of decisions and events that led to the outburst.\r\n\r\nYou can't medicate the symptom and avoid the cause. To do so is beyond irresponsible: it actually allows the patient to indulge in the wrong behaviour, believing that the medicine will save them, rather than trying to fix themselves.", "Ubuntu is the closest thing to humane Linux, but it's got a long way to go before it's as friendly as Windows. Before I got my Mac, I used Ubuntu fairly regularly (dual boot, Windows for Photoshop, etc.), and several of his points are unfair.\r\n\r\n* Complaints about bundled Windows software are absurd when you look at the amount of stuff that comes with typical Linux distros and OS X. I had a *wretched* time getting rid of Totem, and making music play in XMMS and video in VLC. (beyond just the basic installations and file associations, getting things like the browser plugin and so-on to work were unbelievably painful.)\r\n* Complaints about Windows startup times are ridiculous. Linux has *never* had quick boots, and Ubuntu--with all its autodetection stuff--is one of the worst offenders. (and don't start with the whole \"you never actually *need* to reboot it\", that's an avoidance of the issue)\r\n* The Windows control panel is right there on the Start Menu. There's no more voodoo to it than finding the configuration on any OS. He complains about removing programs on Windows, but provides no comparison on Ubuntu.\r\n* Windows Help may be bad, but the Linux equivalent is \"Google aimlessly in the hopes that some random guy had your problem and blogged his solution.\"\r\n* To claim that package management is more intuitive than \"download and run setup.exe\" is 100% preposterous.", "This is the first Onion article I've submitted. I think it's a brilliant bit of humour, particularly poignant given all the NSA hullabaloo recently.\r\n\r\nI like that the Onion can manage to be absolutely hilarious and relevant about current affairs, and yet not come across as overly partisan, the way much satire does.", "I fully understand your point. And obviously peer pressure is no way to treat anxiety, whether \"organic\" shyness, or genuine chemical-imbalance [SAD]().\r\n\r\nBut I think the point of the article is with regards to medicine, specifically. If a doctor identifies social discomfort as a symptom, then confidence-building activities (or whatever other kinds of therapy) should be step #1, with actual meds only administered as an extreme step #2.\r\n\r\nI mean, hey, I'm not naturally an outgoing person. The experience that gave me the most practice in faking it was being a summer camp counsellor. It's a job that requires you to be (genuinely) excited and enthusiastic with your campers all day long, and be totally into the silly theme stories and sketches. And all of this is *right in front of the other staff members, 50% of whom are female*. Camp is a safe environment to practice \"putting it all out there,\" as the likelihood of rejection is almost zero. (No, it's not directly practice \"picking up a woman,\" but there's a lot of opportunities to practice the subskills of starting/maintaining a conversation, holding doors, telling jokes, etc.)", "I didn't claim to be a Linux pro; I'm simply narrating my experiences as an uninformed end-user using the system. Which is, I believe, the type of user being discussed in the article.\r\n\r\nFor that user, all of the package management features that you list are either not apparent, or serve only to confuse. My point stands that it's insane to expect Mom and Pop to go tracking down the dependencies for things.", "I was not aware of *Archaeopteryx* until reading this piece.\r\n\r\nMy opinion has never really been settled on the whole thing, except to be vaguely inclined toward an evolution without the rabid naturalism. I'm not sure if that qualifies as ID or not... either way, straight-up evolution seems to come as a package deal with a lot of atheism/agnosticism baggage.\r\n\r\nAs for the [various YEC theories](), they're certainly intriguing, if not overly persuasive.", "The picture of the discoloured fingertip is grossing me out. Do all the implants look like that, or is that one that went wrong?\r\n\r\nI use all my digits for typing, piano, guitar, etc. I can't really picture having an extra metallic lump just under the surface of one of em.", "I can't be sure, but I expect that if you watch the replies to my comment, you'll see soon enough.\r\n\r\nAs a quick example, check out the article linked in [this post]()... the author's acceptance of evolution is intrinsically linked to the crumbling of his faith. I'm not really up for a debate about my Christianity right now, which I struggle with, but ultimately believe in for reasons quite unrelated to earth-origin theory.", "That could be bad in high school... but again, it depends on personality. Kind of like the boy named Sue, she'll end up tougher than nails.\r\n\r\nOver the course of my education, various individuals saw fit to mock my surname, but a little distain goes a long ways in shutting down stupid insults.", "I've tried to be optimistic, but the creepiness of Google is becoming increasingly difficult to ignore. The biggest warning sign for me was noticing that **gmail.com** just redirects to **google.com/mail**, meaning that all the search histories and click-trail data can suddenly be correlated to email accounts and names... yikes.\r\n\r\nThis *is* a good idea, though, but I'd really prefer it be a different company. Or even better, something where I install the server component on my own webspace. (A possibility that's not out of the question... you could even make it compliant with static hosting by just using S/FTP for the sync.)", "Right, but whether you go to **googlemail.com** or **gmail.com**, you end up forwarded to the **mail.google.com** subdomain. It's significant because it means that the GMail application is sharing cookies with every other Google service, including the ones you don't log in to use.", "It seems pretty obvious which way this discussion is headed, so I probably won't stick around for much of it. The article is so hopelessly sensationalist that there's really just not that much to be said. **Evangelicals get salvation through punishment and pain?** I've never *heard* such a thing. New Testament salvation has always been a free gift of grace. As for God (the Father) as some kind of tough love disciplinarian, a good reading of the OT history books might be in order. He dishes out the punishment when it is deserved, but the overwhelming story paints a picture of infinite patience and caring.\r\n\r\nIf spanking is to be done, I definitely think it's right that it be a parent-only thing. Parents have a connection with their child in a way that school officials simply do not.\r\n\r\nAs is oft-repeated: if the spank is applied in haste or anger, then it's abuse. If the parent enjoys applying it, it's abuse. If it left a mark, it's abuse.", "Because it's a dynamics system, and all the different forces have to stabilize. Each node repels each other node, plus all the tensions between nodes... the algorithm is inherently (n^2), with no obvious way to optimize it. That's why it's kind of sluggish, particularly for words with a lot of meanings.", "**Update:** I had been using Breezy on my desktop, but I realised that I haven't booted it since I got my standard-issue D-Link wi-fi card. \r\n\r\nBecause now, it crashes on boot trying to autodetect this piece of commodity hardware.\r\n\r\nI'm not saying Windows doesn't have device problems too, but I have very little patience for it on a system like Ubuntu that promises plug and play.", "Actually, in both cases, you beat everything in the half circle ahead of you (counter clockwise) and are beaten by everything in the half circle behind you.\r\n\r\nIt looks messed up, but it's not really that bad.", "I agree. It's a good idea, something I've meant to implement myself for some time. I still read a handful of hand-coded sites, and it's a pain to go checking them.\r\n\r\nI assume you just compare hashes or whatever, but is it smart enough to discredit rotating content (advertising or otherwise)?\r\n\r\nAlso... why is this a log-in service? Why not just provide anonymous feeds, like \r\n\r\n\r\n\r\n?", "&gt;Charity concert number fifty-seven was the last straw for me, although I did appreciate the irony of washed-up rock stars raising money for washed out communities. There's a world full of tragedy, but it takes a special kind of high profile catastrophe to get the celebrities and the has-beens out. In 2001 I noted that it would suck to be a fireman who died on September 10th. And I'm getting that feeling again. In 2005, it would suck to be a victim of anything other than a tsunami.\r\n\r\nConsider me amused.", "&gt; I think if we did a short experiment and put 100 people in some kind of hard situation, most of them would be willing to do whatever it took to benefit themselves, even while hurting others.\r\n\r\nSee, I don't know about that. I think the level of caring is inversely proportional to the size of the group. If you put *10 people* together in a tought situation, they're much more likely to band together and work through it than if you throw in 1000.\r\n\r\nOf course, the thousand group will just splinter into factions, which is, I suppose, what happens in the real estate market.", "I don't watch any televised sports, particularly, but I hope you're not comparing soccer to American football or baseball. \r\n\r\nAt least soccer isn't a game that stops every ten seconds for a strategy meeting. Or one where the most on-field movement is as the teams rotate.", "Dude, that's awesome. I'm both fascinated and terrified at how you've diluted your personal relationships for a gain in efficiency.\r\n\r\nIt's almost like a movie soundboard, except that it's IM, and the quotes are all your own.", "Obligatory: [Rogue Scientist Has Own Scientific Method]():\r\n\r\n&gt;The brash chemist, who conducts independent research from his houseboat, has infuriated peers by refusing to \"play by the rules of Socrates, Bacon, and Galileo,\" calling test results as he sees them, despite overwhelming evidence to the contrary.", "&gt; You know, ah, you know how you get scared or worried or nervous, but you don't want to be scared or worried or nervous, so you push it to the back of your mind? You try not to think about it. Your amygdala is what lets you do that. It's like a filter in your brain that keeps your feelings in check. She feels everything; *she can't not*.\r\n\r\n**Edit:** You philistines don't appreciate a well-placed Firefly quote, but I refuse to delete it!", "I'm having a bit of trouble swallowing the whole \"legal\" thing. Especially if he's doing the fireball bit in the middle of the highway.\r\n\r\nIs it legal in California to operate a flamethrower out the window of your vehicle?", "I think if you consider *some guy wrote it down in a brainstorming session once and attached a price tag to it* to be \"for real,\" then there'd be an awful lot of other messed up things to find.\r\n\r\nThe article doesn't provide any evidence that any of this ever got beyond the \"wouldn't it be cool if\" phase.", "It doesn't sound like the thoughtful words of a Christian minister who carefully considered his life and the evidence and then embraced atheism:\r\n\r\n&gt; Basically, there is nothing about any of them that compels the educated mind of today to give them a second look. Every religion is just as desperate and hopeless as the next.\r\n\r\nBelieved-in by the vast majority of the Earth's population and the concept of the supernatural just isn't \"compelling enough\" for a second look? This sounds more like a petulant sixteen-year-old trying to make himself a scholar.", "This is an extremely cool idea, but it's far more difficult to implement technically. The only way I can really see of doing it would be be to scan the actual article texts for \"statistically improbable phrases\" or whatever, and then compare the number of matches from one submission to the next.\r\n\r\nThere'd need to be a way to override the software's assumptions, though, and that's the really tricky part.", "In other news, please do support artists who release their stuff independently.\r\n\r\nFor example, the most recent Harvey Danger album (which was excellent) was given away for free on their site. I would never have purchased it otherwise, but I enjoyed the songs, so I sent them a us$10 \"donation.\" It's not tons, but it's a much bigger cut than they would have got of the CD purchase that I wouldn't have made.", "At least the sculpture was actually a sculpture. You know, sculpted out of something into a particular form, etc. It may not agree with you, and it might freak you out late at night, but at least it's *something*.\r\n\r\nWhen I think *modern art*, I'm thinking those gigantic canvases covered in a single colour.\r\n\r\nReally, it's the curators more than the artist who's at fault here.", "&gt; ... saying that we've found a missing link just lends credence to the creationist claim that there are gaps in the fossil record.\r\n\r\nAnd the alternative is to pretend that the gaps don't exist? Unfortunately my own research on the topic is hopelessly limited, but it does seem clear that for 6 billion years of so-called \"continuum,\" we've got precious few examples of actual half-way species.\r\n\r\nSo yes, it is nice to hear about new discoveries that help fill in the gaps.", "Yeah, it was definitely the characters that drew me into Firefly; I found the BSG cast a lot more splintered. Besides that the scumbag Baltar was pissing me off.\r\n\r\nAt least they both seemed to adhere to the \"no aliens\" policy, something I definitely approve of. Once the latex suits started showing up, that was the end of Stargate Atlantis for me.", "I'm not really sure what you're getting at here, but if it's lower level control that you require, your best bet is Canvas.\r\n\r\nApart from that, yeah, you're stuck with Flash.\r\n\r\nAs for this,\r\n\r\n&gt;I just want to know when will Firefox and some future version of JavaScript(?) get out of my way, move beyond the HTTP model and allow me to build web apps that can fully utilize the network and client PC capabilities.\r\n\r\nI'm not even sure what it is you're trying to say. Is there some alternative to request-response that I'm not aware of? Besides multicasting (which is emulated surprisingly well by Bittorrent) and data-push (which is impossible because of firewalls and yet almost-possible given Ajax-y poll/update mechanisms), is there something you're trying to achieve that's not possible given current web architecture? What is it about the network that's not being \"fully utilized\"?", "A determined spammer could just use his botnet to register dozens of accounts that all vote up each others' spammy submissions.\r\n\r\nOf course, in a world where the Recommendation engine created actual distinct communities, the bots would be the *only* ones enjoying each others' articles...", "&gt;It's like Apple is parodying its own image while also cementing it.\r\n\r\nI sort of thought that was obvious.\r\n\r\nI think the ads are amusing, if not entirely factual. The assertion about updating drivers is *very* true if you have a PC with a newer graphics card, particularly an ATI. Also, depending on how long it sat on the shelf, you could very well turn it on the first time and have to let Windows download 200mb worth of updates and patches.\r\n\r\nThe claim about trial software is a bit unfair, though. My new MacBook had trials for Office, Pages, and Keynote, plus the occasional appeal to try out .Mac for 30 days. I realise that dumping these in the trash bin is easier than the Windows installer, but it's not like there was nothing bogus on there.", "I always assumed that that was other reddit users simply being courteous. Voting a submission to exactly zero sends the message of \"sorry, but do try again,\" whereas a massive negative score seems more like a vindictive dismissal.", "I was a bit surprised that Frontrow/Quicktime didn't ship with more standard codecs. And the deinterlacing filter in the built-in DVD player is almost worthless.\r\n\r\nI use VLC for pretty much everything.", "I don't believe IE7 has any remote-typeface support, and it's not even *released* yet.\r\n\r\nTranslation? It'll be a long long time before any reliable chunk of the browsing populace has this feature. For now, you're pretty much stuck with [sIFR]().", "I'm kind of surprised to see ALA publishing this kind of stuff in 2006. I thought we all had content-style-behaviour separation figured out ages ago.\r\n\r\nThose who don't do it now (hello there, Rails apps) aren't likely going to do it ever.", "90% of MSN's users just visit and then inexplicably surf away without using *any* products--they just never bothered to change the default IE landing page.\r\n\r\nThe other 10%, of course, use only Hotmail and nothing else.", "See, my issue with this is that it's equating \"hits\" to \"usage.\" I'm a *huge* fan of Google Maps (hell, I'm writing a book about the API), but I still only use Maps a couple times a week, whereas I might do upwards of twenty web searches per day.\r\n\r\nAlso, I'm generally skeptical of this Hitwise data for the same reason that everyone is skeptical of Alexa.", "You got me, it was a lazy comment. In my defense, however, the rest of the domain is blocked by Websense for being an *Advocacy Group*.\r\n\r\nPlus, the unspoken rules of internet journalism would suggest that even a summary page should have each claim link to the relevant pages in the report itself.", "I can't do anything to stop you, but I think it's extremely unfair (and indeed, in the Scientologists' best interest) that you lump Dianetics in with the teachings of \"real\" religions like Christianity and Buddhism.\r\n\r\nEven though heinous actions have been committed in the name of most belief systems, none of them have the modern legal presence that the Church of Scientology does. None of them keep central repositories of dirt to blackmail their members, nor do they have the ability to control and terrorize their followers/defectors.\r\n\r\nYou can't honestly tell me, with a straight face, that [a story like this one]() would come from a former Catholic. (Yes, lots of born-again atheists say that they feel freed of bondage and so-on, but none that I'm aware of suffered the mental torment that this woman relates... part of which was brought on by chemicals prescribed by her Scientology doctor.)", "+1 for \"[money laundering]()\"\r\n\r\n(I have a family member who works in fraud investigations at a major bank... they deal with this kind of thing all the time.)", "Actually, there are loads of people who profess to \"believe in God but not religion,\" as if their own personal brand of chaotic spirituality represents some kind of particularly enlightened stance.\r\n\r\nIt might give them warm fuzzies, but without any actual community or specific beliefs, there's just not much there...", "Basically, yeah.\r\n\r\nThe Catholic church may have been in charge, and abused that power in inexcusable ways, but since then it has *significantly reformed*. As far as I can tell, these practices of the CoS are not some ruling class that's gotten out of control, they *are the religion itself*. **Part of being let into the higher orders is swearing not to tell anyone the secret beliefs... in order to leave, you have to sign affidavits saying Scientology has never hurt you.**", "Since I Switched about a month ago, I've been interested to observe the OSX software scene... for OSS programs that are easily portable (written in Java, for example), there is almost no dedicated Mac competition. Why try to write a bittorrent client, when Azureus already owns you in every single respect? (There *is* [Tomato Torrent](), but guess what? It's free.)\r\n\r\nHowever, the thing about software where there's *not* an OSS solution, is that developers automatically assume they can charge for it. Even utilities that perform trivial tasks like [allowing a notebook to function lid-closed]() or [copying music to a UMS MP3 player]() seem to have price tags attached to them.\r\n\r\nI'm not saying that the developers don't deserve something... it's just a little bit of a shock coming from the PC scene, where no one would dream of trying to charge for those kinds of programs. Indeed, for several of my free PC programs, I donated to the authors... but giving and being charged-for are very different kinds of transactions.", "The problem with it is that the karma is given as a reward for *submitting good articles*, but then it's being used for what's basically unrelated: enhancing the vote on *other peoples' good submissions*.\r\n\r\nThe difficulty is thus:\r\n\r\nWhat about a user who submits good articles, but whose judgement of others' articles is lacking? Are we to punish that user by going and arbitrarily voting down his good submissions, just to bleed off karma?\r\n\r\nI know it's sounding like kind of a panacea, but isn't the Recommendations page supposed to do basically this? Like, lend more weight to the votes of people who typically agree with you?", "This is so completely absurd that I'm really at a loss for what to say.\r\n\r\nThe trinity, as a doctrine, is only very loosely grounded in scripture, but the kinds of passages it's based on (like Jesus' baptism, where the Son is under water, the Father is speaking from heaven, and Spirit is descending like a dove) clearly emphasize the three roles, not the fact that there are three arbitrary entities to be named at will.\r\n\r\nBut, hey, what the hell... I'm the guy who cracks up trying to digest the ridiculous gender-neutral lyrics in the United Church hymnal.", "Yeah, I don't think it's sex *itself* that's loathed, it's the baggage that comes along with it, as evidenced by this paragraph: \r\n\r\n&gt;Welcome to the new breed of healthy young men who rate sex way beneath their other appetites. In this brave new world, girls are a pain, a disappointment, and rather dangerous to the soul. Self-preserving boys would rather be satisfied with a brew and bit of beef than an erotic tide of reckless passion.\r\n\r\nAnd baggage isn't even the traditional baggage of having to be in a relationship (most single guys I know would like nothing better than to be in a stable relationship), it's the baggage of self-confidence and anxiety.\r\n\r\nA beer and a cheeseburger may be a temporal pleasure, but it's not one that judges you or has any possibility of crashing and burning.\r\n\r\n*Full disclosure: I'm writing this at a McDonalds, from my laptop...*", "There are definitely some \"tourist\" homeless in Toronto... the kind who hold a sign proclaiming that they're starving, but only want cash. (I prefer not to give money, but if I have the time, I'll offer to buy them a meal...)", "I remember trying this several months ago, and my overarching impression was \"Well, it's nifty, but in the time it takes me to muck about with this web interface, I can already have downloaded, installed, and used Irfanview.\"\r\n\r\nThe fact is, Irfanview is quite simply perfect in terms of blending simple editing/scale/color-adjust features with batch processing modes and intelligent drag-n-drop.\r\n\r\nDrag and drop and clipboard support are probably the biggest wins for a desktop editor. Half the things I edit in Irfanview aren't even files, they're just blobs of image data sitting on the clipboard, where I need to make a quick crop or something. (screen captures, for example...)", "I would use almost *anything* over the GIMP. I've made several concerted efforts to understand that software program, and have never been able to unravel the thick web of deceit and confusion from which comes its interface and toolset.\r\n\r\nEdit: Anil had some swashbuckling [GIMP criticism]() a while back...", "The bookmarklet can help ease some of this pain, provided that the image in question is publicly hosted somewhere. (No, don't bother trying to have your JS base64 a file and then post it through it form. I got it working but even small images took forever.)\r\n\r\nMy concern isn't lack of features, it's simply that the the #1 features are impossible: cut and paste, drag and drop.\r\n\r\nAnd I guess the trick there is to really carve out new uses for Snipshot that make it somehow superior to a desktop app for some subset of features. It would be really cool, for example, if you could pick up where Photon left off, and build in some generalized XML-RPC support (beyond the Flickr stuff), for quick posting of crops to blogs.", "Yup. Just press PrtSc, and then jump to whatever your image tool is (Paint, if you want) and press ctrl-V to paste it in.\r\n\r\nIrfanview lets you mark out a rectangular area by clicking and dragging, and then there's a \"crop\" option on the edit menu.", "It would be nice if more people had this attitude. A few weeks ago I was stuck in the suburbs without a map, and I had to tool around the manicured boulevards of Mississauga for almost ten minutes before I could find someone's wifi to borrow.\r\n\r\nOn the other hand, it *is* good that locking it down has become the standard practice, for the very reason demonstrated in the article... unsecured wi-fi gives hax0rs pretty much complete anonymity.", "Regardless of how *you* may feel about the family's so-called \"phobia\", the fact remains that many parents do like to control the rate at which their young children are exposed to certain cultural elements.\r\n\r\nMale and female toplessness is generally considered crude (though legal) in a lot of places... I saw a woman in downtown Toronto the other day walking her dog in just a skirt. But full nudity and simulated sex acts, in public areas of the hotel?\r\n\r\nThis episode reflects poorly on the travel agent, and also on the hotel, for not upholding established standards of public decency.\r\n\r\nMy question is this, though: Would the shoot have been given the same priviledge if it was for a seedy website rather than Playboy? Is there some \"presumption of classiness\" that goes along with the bunny ears?", "Well, yeah, particularly when the biggest areas of growth for Christianity (especially [Pentecostals]()) are in [developing nations](;n=Top%2fReference%2fTimes%20Topics%2fSubjects%2fT%2fThird%20World%20and%20Developing%20Countries).\r\n\r\nIt's obviously not the case there that they \"got religion\" and then gave up--or lost--their wealth.", "This is brilliant. I guess I basically knew that it was possible, since I've made RJ-45 crossover cables. But it never occurred to me to actually do it.\r\n\r\nAnd you only need one cordless phone, of course. If the wireless is out in the tree fort, the wireless' base station could sit right beside the second phone in the house.", "&gt;I would guess that through most of humanity's history, children were more aware of the specifics of sexuality than those in the United States today.\r\n\r\nWhether or not that's true is irrelevant to the discussion. It's not the job of hotel proprietors or Playboy magazine to decide how to raise this family's children.\r\n\r\nI don't know what the Bulgarian customs are, but even if they allow nudity on public beaches, I expect that frollicking about in public areas such as hotel corridors is  *not* normal.\r\n\r\nI still maintain that a) Playboy were given special treatment, and b) the travel agent should have known or alerted their clients.", "&gt; I simply pointed out that humanity has gotten along even though children probably did see and were aware of sexual activity much more in the past.\r\n\r\nRight, and the implication was, \"the parents should STFU and let their kids be exposed to whatever society wants to throw at them.\"\r\n\r\n&gt; They also weren't having sex in the hotel's corridors; at least, nothing like this was mentioned in the story. As far as I can tell from the story, the film crew rented a room and had actors on the room's balcony, which was apparently visible from areas outside of the room.\r\n\r\nMy initial understanding was that the \"simulated sex\" was on the balcony, but that there had been nudity elsewhere in the hotel. Upon re-reading, it does seem that all of the friskiness was confine to the balcony.\r\n\r\nI'm still kind of surprised that a 4-star hotel would allow it, though. I could picture topless sunbathing on a hotel balcony, but dry humping and a film crew? I'm trying to imagine this occurring at a Sheraton or a Four Seasons, and it's not really happening.", "Okay, fine, the wording may have been a little awkward, but isn't sort of a general convention in argumentative blogging to cite controversial claims by linking the statements to source data?\r\n\r\nLinks are the new footnotes.", "The thing about this is that *both* Suduko and crosswords can be generated entirely by a computer.\r\n\r\nThe \"art\" in making a crossword is balancing everyday words with bizarre space-filler ones, and in balancing throwaway clues with ones that only a small minority will recognize.", "That's definitely intriguing, but I'm curious how that particular trait would be \"naturally selected\"? Doesn't evolution generally favour a population that expands as quickly as possible? (excluding cases where the lousy ones are killed off, but surely you can't generalize that younger siblings are weaker or less worthy to reproduce...)", "&gt; If you are implying that younger = weaker = gay\r\n\r\nIf I implied this, it wasn't intentional. I was simply drawing the comparison with \"herd control\" mechanisms in other species. Which tend to be predators that kill stragglers. If the hypothesis is *correct*, that breeding homosexuals is a method population limiting, it would be odd--from an *evolutionary* perspective--that they end up with the best genes.\r\n\r\nWhether you call the selection \"worthiness\" or \"completely arbitrary\", there's obviously some mechanism in the woman that triggers this tendency in successive offspring. And presumably it would be somehow tied to a subconcious perception about whether the herd should expanding or not...\r\n\r\nAnyway, whatever. I probably won't post again in this thread.", "I concur. The second season isn't quite as sharp, but the first one should seriously come with a warning sticker. Most people I loan the DVDs to seem to burn through the 22 episodes in under a week.\r\n\r\nSo yeah, [sample the first two episodes](), but not if you have fast internet and, you know, important things to do.", "&gt; ...the shockingly durable fame of Paris Hilton, who, incredibly, appears in several early episodes of “Veronica Mars” as a particularly vapid and cruel ‘09er.\r\n\r\nShe was only in one episode; according to interviews, she was impossible to work with.\r\n\r\nThey actually make a funny reference to it in the second season... Veronica has had a fitful night, and Keith asks, \"Did you watch House of Wax again? You know that Hilton girl gives you nightmares.\"", "I remember working this through when I bought my first phone. I didn't try to pretend that it was *only $40 a month*. I acknowledged taxes, long distance charges, and the three year contract, and decided that the total investment for three years of cell-phone ownership would be a little over $2000.\r\n\r\nIt's more painful that way, but it's better to at least see the beast all at once.", "Another big one I've noticed is pizza toppings. Domino's, for example, has had a long-standing deal where you can get three medium one-topping pizzas for $15 plus tax. This is an absurdly good price compared to the rest of their menu; most \"specials\" involve extras like wings or garlic bread, and jack the price up to over $20.\r\n\r\nBut you have to be careful: toppings come in at something like $1.50 apiece. So if you tell them to make one of them \"Hawaiian\", they throw on ham, pineapple, and extra cheese, and your bill is suddenly $18. (still a decent price, but adding two extra toppings raised the value of the one pizza by 60%...)", "Without a doubt. I bought a $200 Samsung nearly two years ago, and I couldn't be happier with it. Fast crisp prints, and I'm still running on the toner that came with it.\r\n\r\nThere's no colour, but I realised when I purchased it that I do all my *good* colour prints at shops, anyways.", "&gt;There are actually many homeless people in need of some very real needs like food and shelter.\r\n\r\nUnfortunately, they're the least likely to get your dollars. It's the \"professional\" ones who have their game figured out: locations, dress code, performance, the works.", "I find this line particularly amusing since *the dealer lost out completely*. If he'd given a good quote, they would've made a sale and gotten a reasonable commission. If he'd given a bad quote, well, he *might've* made the sale.\r\n\r\nBut by refusing to give the quote, **he's actually turning away business**.", "Same in Toronto. Officially, there are additional rules governing proximity of smokers to building entrances, but the establishments in question (pubs, bars) have very little vested interest in trying to enforce these.", "&gt; The interviewee thinks \"people must embrace rationalism\" I'm sure that guy thinks he is rational, along with every human being on the planet.\r\n\r\nI've always had kind of a dim view of words like \"rationalism\", which I tend to throw into the same bin as \"Homophobia\" and the \"PATRIOT\" act.\r\n\r\nIn response, I've decided to call my own personal philosophy *sensibleism*, and arbitrarily declare anyone who disagrees with my religious views or political agenda as *unsensible*.", "Thanks.\r\n\r\nTo be fair, though, I'd be curious to see results where the inmates' prior census data were used, rather than their answers to a psychology professor. I'm not trying to deny the conclusion of the study, but I suspect that the context of \"what is your religion?\" can greatly affect its answer... it's a little unfair to compare the population at large (polled by paper survey) to criminals (polled, in prison, by intimidating shrink).", "What's done is done. Whatever injustices have occurred in the past, there's no point living in a state of self-loathing for the actions of out great-great-grandparents.\r\n\r\nMy apologies to Ms. Priyamvada Gopal, but does she even really propose an alternative? (I began skimming about halfway through...) If the Americans and British had spent the 19th century twiddling their thumbs, how would the modern world be different? Would the differences be a good thing?\r\n\r\nHere's a start: English would be confined to Europe, North America, and a few international elites... without any mechanism for communication, there would be no such thing as the global Internet. Those suffering *today* in the world would have almost no voice to tell the West about it. (Many still don't, but internet cafes + blogspot goes a long way...)", "I noticed the same thing on my laptop. I don't really understand liquid-crystal, but it seems that viewing from off-angle vertically weakens the saturation, which is, of course, exactly what it's supposed to test.", "&gt; Providing affordable necessities and jobs, both here and abroad, are good things.\r\n\r\nI'm with you on that.\r\n\r\nIt's not like WalMart is the cadillac of shopping experiences, anyways. You pay for what you get, and on most of the kinds of items that WalMart sells, I'm willing to pay a slight premium for sales help, clean floors, and no screaming children.\r\n\r\nI may not be totally on board with the government assisting them, but they *are* providing both jobs and goods to those least able to otherwise acquire them. Are the workers overworked and underpaided? Sure, but they're also at the bottom of the ladder and gaining valuable **experience**. In a couple months they can quit, get a job at Future Shop, and free up their old job for some other barely-making-it person.", "I was working from this statement: \r\n\r\n&gt; W. T. Root, professor of psychology at the Univ. of Pittsburgh, examined 1,916 prisoners and said \"Indifference to religion, due to thought, strengthens character,\"", "&gt; gosh, I guess it's NO BIG FREAKING DEAL AT ALL...\r\n\r\nNo, it *is* a big deal. Amazon may have your address, credit card, and purchase history, but they don't have your email archive, search history, and appointment book, do they?\r\n\r\nWhat about when you're logged in and using Google Maps or Google Image Search? What about the dozens of Adsense sites you see every single day, that recognize your IP address?\r\n\r\nThis company has an *extraordinary* amount of profile data on millions of users.", "I kind of thought the \"Tarzan\" thing gave it away, but anyways:\r\n\r\n&gt; Four years ago a patent attorney in Minnesota named Peter Olson demonstrated this by submitting the following patent in the name of his five year-old son, Steven. The patent was granted. Read it and weep.", "The obvious alternatives are MSN and Yahoo. You need cookies to use logged-in services, of course, but you can block them for \"www.google\" and \"maps.google\".\r\n\r\nThe [customizegoogle]() Firefox extension has some additional privacy features, as well.", "I've enjoyed reading a lot of the 419eater scams in the past, but I'm in agreement with you on this. I don't even mind when they bait for cash... but in this case, there's obviously *someone* along the line who put a lot of labour and attention into these pieces, and I feel dreadful for them. (especially since their \"pay\" for it was probably a cut of the scam money, which now turns out to be nothing...)\r\n\r\nAs was said elsewhere in the thread, there could totally be a legitimate business built around those kind of carvings, if someone could get the infrastructure together. (Sell via internet: authentic African hand-carved pop culture figurines... sort of like Ten Thousand Villages, I guess, but without all the baggage of actually running stores)\r\n\r\nIt would be a great PR move for Disney or whoever to \"sponsor\" the operation by agreeing not to sue for infringement on the characters.\r\n\r\nI dunno, I'd love to have a Helen Parr or The Iron Giant to put on my desk."], "Fountainhead": ["But also the most unlikely to vote.  Who won the last election, Bush, why?  It wasn't because of a bunch of advertisements, it was because he got the religious right to vote in overwhelming numbers for him.  How did he get those people to vote for him?  A very large grass roots movement in the churches around the country.  People convincing people that Bush was the best choice for them.  And he was, for that group, not for me.", "I understand your point but there probably is a grassroots effort trying to do what ever it is you want to do.  What you have to do is get involved, give money to causes you agree with and try to convince people.  \r\n\r\nPersonally I'm happy that so many people don't vote and choose to watch American Idol. It means my vote makes a bigger difference and the more people I convince the bigger difference it makes.  It also means the organizations I give money to can make a bigger impact on the people that do vote.", "Well last time I checked the Japanese gave us anime along with some great food, the Arabs seem to enjoy religious zealotry.  Of course it's a lot more complicated than that but the Arab world would be wise to follow Dubai's example.", "The only real alternative we have right now is fission.  It has waste that we can mediate and it doesn't cause global warming.  Unfortunately, thanks to the environmental movement, we haven't invested in nuclear technology so it's still expensive and inefficient.", "I wonder if this is because we have such poor k-12 education in comparison to other nations.  Though our educated leaders think intelligent design is a science so maybe all of our education needs to improve.", "Last time I checked they granted bush that power.  THEY VOTED FOR IT!  They may wish they hadn't or wish that they had asked more questions but they didn't. They voted for it.  I'm prepared for your \"but they were lied to\".  They shouldn't have voted for it. Many of the people in the know like Scott Ritter argued that Iraq didn't have weapons.  He was the freaking UN weapons inspector.  He would know of all people.  The democrats have just as much blame as bush. \r\n\r\nPlease tell me the current democratic exit strategy?  I've looked everyone says something different, it's not coherent, it's not specific, and it doesn't address the long term problem we've gotten ourselves into.\r\n\r\nBTW, i wish redit would stop auto formating the number lines .  I know that you typed 2, reddit turns it into a 1.  it's odd.", "I should have been more specific.  The democrats in congress granted Bush the ability to go to war in Iraq.  The democrats voted for the war.   Granted not all did, but enough to give bush the power.  At the time the senate was in Democratic control.  Let me find the numbers…\r\n\r\nThat measure passed 250-183 in the House and 52-47 in the Senate.\r\nThe Senate vote sharply divided Democrats, with 29 voting for the measure and 21 against. 1 republican voted against it.\r\nIn the House, six Republicans and 126 Democrats voted against the resolution.  81 Democrats voted for it.\r\n \r\n\r\nBasically the senate was controlled by the democrates, they could have kept us out of war.", "I agree.  They pre-approved a pre-emptive war that never should have happened.  They even had limited conservative support.  I expect the republicans to go along with their president, I expect the democrats to have some brains and balls to appose idiot ideas.", "I couldn't find any other source backing up the lancet study.  Because of that I'm more likely to believe the IraqBodyCount, I'm also hard pressed to say the IBC is putting out propaganda.  \r\n\r\nPersonally I wish we didn't use ANY foreign oil and just left the Middle East to figure out their own problems.  I'm sure we are on the same page with that.  \r\n\r\nSo in your mind you see no difference between the holocaust, the tragedy in Rwanda and Iraq?  Wow.  I see a lot of differences.  This war is being fought over access to oil.  If we wanted to kill all the Muslims this certainly is a very slow way of doing it.   Seems to me we could be nuking all major Muslim cities.  That would be genocide.  I find your comparison disgusting.  What happened in Rwanda, WWII, Cambodia and other places is degraded by it.  This war never should have happened, it’s unjust in all kinds of ways but it is not genocide.    As well as a civil war is not genocide.\r\n\r\nI also sense your solution to the problem would be to pull out all the troops and not support Israel anymore?  As well as not interfere in future conflicts in the area?   I think that would leave Iraq in a state of collapse and the amount of deaths that would result would be tragic.  We must pull out, but they must have a semi functioning system before we do.  I think it would behoove us to end involvement in the region and let them figure it out for themselves. \r\n", "This is great!  I just get done listening to Michael Savage arguing with Pat Robertson over whether or not non-evangelical Christians are “lesser people”.  Michael savage doesn’t think they are lesser people and Pat Robertson thinks they are.   Now I get to read more ideas that make me smile.   BTW Michael Savage pretty much came out and said he was a universalist.", "The \"point\" is so that other people that are just exploring ideas can get other ideas. This isn't about convincing the person you are arguing against.  This is about explaining why you think what you do in hopes that people can at least understand your viewpoint.", "You sound much more like a moderate Christian trying to explain the fringe of Christianity.   You are doing a good job of not letting the arguments question you directly, you could just be a very healthy fundamentalist, but it’s far more likely that you are a moderate Christian that continues to attempt gaining insight to what others think and believe.", "I also find his reasoning that Iran should be able to have a nuclear weapon to defend itself a little short of insightful as Iran's leaders tend to talk about destroying Israel as soon as they can.  Iran’s idea of defense sounds a lot like a good offence which is exactly what was wrong with the Iraq war.", "So some comments about Christianity is \"hatred\".  I usually see hatred as people yelling and using profanity.  People being violent. I don't see any of that in Huge section of comments or in the story.  It doesn't appear to me that any people here have a intense hatred toward Christianity.  Why do you think these people hate Christianity?", "Yea, I find it amazing how those groups do more damage to our enviroment than help.  If it wasn't for reactionary enviromentalists we could have had a working nuclear industry (which we don't right now) for the last 20 years.  Because of them very little money is splent on research and development.  It drives me nuts.", "I don't think you are talking about the same thing.  Very few people think that the earth isn't warming the controversy is on what's causing it and how do we fix it effectively.  Also there are lots of disscussion about past warming/cooling cycles.", "At first I was just going to say that it would have made the trip to the zoo even more educational for the young people.  However if I was there I would seriously try to save the guy.  Also assuming I did save him I wouldn’t just leave it at that, I would try to “teach him to fish” or at least try to explain a worldview that he might embrace and live a healthier life from.", "I really wanted to find an article discussing youth retention rates for different churches but I couldn't find anything all that great.  Last week I heard a statistic that 75% of kids from evengelical families tend to denounce the faith but I couldn't find any supporting evidence.", "I also wonder if most of the mainline churches lose members faster than conservative churches because their members are more apt to not \"need\" religion in the first place.  The ones that do need a faith will look to conservative churches as providing more of a bedrock belief.  If so I could see a peak then a long decline in conservative churches as members become disillusioned or their kids see mainline churches as a healthier alternative.  I see churches such as the Mormons and universalists continuing to grow as their religions allow for a large amount of flexibility.  I’m trying to find a study that might support this hypothesis…\r\n\r\nNow i'm a true dork and have 2 comments to my own article.", "I would really like to see a study that looks at the youth retention rates for the major US religions. I mainly would like to know how evangelical Christian families fair after their kids turn 18.\r\n\r\n\r\n", "Really?  Can you provide links to show that he promoted any kind of rational thought?  From my point of view he just promoted his own ideology very similar to what religions do.  He tried to repress any contrary view and didn't allow any free thinkers in his country.  I think you are confusing communism/socialism with rationality.", "So why do you believe in Yahweh and not Zeus?  Also the reason thewilson changed the criteria is because it's ridiculous to attempt to disprove anything.  Disprove that someone in another galaxy proved the bible and the Talmud were simply stories and had no divine source.", "Maybe you just don't understand the words... \r\n\r\n\"Agnosticism implies the inability to come to a conclusion\"\r\n\r\nAgnostic: \"somebody who believes that it is impossible to know whether or not God exists\"\r\n\r\nIt's not the inability to come to a conclusion.  They came to a conclusion: \"It's impossible to know\".", "Screw that.  It's not how the brain thinks that's the problem, it's the why.  It's like researching a lotto number picker to \"discover\" why the numbers come out like they do.  Chaos theory would be a better explaination than the mechanics of the number picker.", "I can only speak for me but I do.  Some are far worse than others.  Some are perfectly able to function in a modern society without making it worse.  Others tend to try to bring us back 1000s of years by promoting such ideas as creationism.", "Uhm, all he would have to do is stop every instance of a \"bad\" event.  Someone has cancer he cures it, someone wants to shoot someone else he removes the gun, or removes the shooter entirely.  Name a event that god couldn't fix?  or is your god not omnipotent?", "No, at least not seriously in the last 10 years. Rangel proposes this every few years to try to get attention placed on the fact that so many minorities serve in our U.S. Armed Services.  He would like a draft to try to make wars more unpopular to the ruling white elite.  After Vietnam the Pentagon has been pretty firmly against any kind of a draft as it leads to an less effective fighting force.  Poeple that are forced to fight don't fight very well.  It's a non issue that is miss-used by the media.", "While this one is a little boring,  ( if you want items that are a lot more interesting) it does over time help because people that haven't blindly decided might take the time to at least read some facts before they decide.  One of the best stories I've read about a \"conversion\" is here ", "People create headlines to get others to read the article.  The original title may fit the audience the author is shooting for but it usually doesn't match the audience here.  I'm glad people change the title because they usually do a great job of explaining why I should read it.", "This is the only way to really stop this kind of crime.  We have to make it socially taboo.  This kind of crap doesn't go on in cultures that find it socially unacceptable.  This kind of thing wouldn't happen in Japan (except caused by a foreigner) because the Japanese find it socially unacceptable and look down on it.  Where as this girls family/friends are supporting her. \r\n\r\n\"i got ball this is my adress 108 20 37 av corona come n do it iam give u the sidekick so I can hit you wit it\"  \r\nIs not the kind of crap we should accept or support.", "On the article, the guy could have very easily fit evolution into his world view but he questioned the fact that if his mentors had mislead him about one thing what is to say that they didn't do it with other things.  \r\nLots of people that understand evolution believe in God.\r\nI think it's similiar to how the church way back when viewed the idea that the earth revolves around the sun as blasphamy.", "So the following was totally lost on you:\r\nStewart: So why not encourage gay people to join in in that family arrangement if that is what provides stability to a society?\r\n\r\nBennett: Well I think if gay..gay people are already members of families...\r\n\r\nStewart: What? (almost spitting out his drink) \r\n\r\nBennett: They're sons and they're daughters..\r\n\r\nStewart: So that's where the buck stops, that's the gay ceiling.\r\n\r\nBennett Look, it's a debate about whether you think marriage is between a man and a women.\r\n\r\nStewart:I disagree, I think it's a debate about whether you think gay people are part of the human condition or just a random fetish.\r\n\r\n", "Reading your post a year and a half ago made a real difference in my life.   Not so much about religion but about being able to open ones mind to new ideas.  Up to that point I was pretty sure that sites like talkorigins and debating in general was largely pointless to people that have already made up their minds.  After reading your post not only did I have a much more positive view of the world but I try to reevaluate my own convictions when challenged.  I have changed my mind on a lot of issues over the past couple years because of it, I also have firmer ground to stand on for others.  I retell your story quite a bit and have even been told it was an urban legend or made up by an evolutionist!  I want to thank you and wish you all the best.", "Let me try to explain why I modded his post down.  \r\nFirst off I'm sick of the conspiracy stories.  It seems like if the story is about the US government in any way someone is going to post \"the US government masterminded it!!!\" and frankly it's old.  The more likely truth is more boring and people don't like it.  Extraordinary claims require extraordinary proof.  I've seen NO proof.  Sure the bush administration pushed bad CIA data, sure they leaked the CIA agents name and probably a few other things. But to say that they masterminded 911 or put together a fictitious Zarqawi fellow is just not very productive.  \r\n\r\nSecondly it’s all inflammatory and negative without being productive at all.  So what should we do curl up in a ball and die lonely and scared or overthrow our current government so goldenbb can have a try at it?  Both of these option seem to me to be ridiculous.  The truth is we can do things to help end some of the corruption in congress and the presidency but it takes time and people voting based on the issue of integrity.\r\n\r\nThirdly for the most part the media and the administration hasn’t focused on a single person.  If they were it’d be Osama and not Zarqawi.  When was the last time the Bush Administration said “all we have to do is kill Zarqawi and it’s over”.  Most of the media I see hardly mentions Zarqawi anymore except in saying he is the likely leader of al qaeda in Iraq.  Which from the best info we have he is.  That could be totally false but that’s the best guess currently.  In any conflict you are going to talk about the leader of each side.  But I hardly think that anyone is going to think that the war is over now.  I can’t speak for people that watch fox news but then they probably don’t want the news just entertainment.\r\n\r\nAlso our K-12 educational system sucks but it’s not crumbling.  That would mean it’s getting worse, it’s not, it’s always been really shitty.  However we do have a good university system to make up for it.  Also no government is perfect, Europe although didn’t fuck up Iraq did do a bang up job fixing the Bosnian war.  Also I’m sure Europe has some wonderful governments that always tell the truth.  \r\n", "Not only that but as little as our people care about education we have more young people getting a college educations than Europe. 27.1% to our 33.1%\r\n\r\n", "Yea, all the studies show how well corporal punishment works and allows people to grow up to be healthy functioning adults that don't over eat and don't have tons of psychological problems from their parents beating them... oh wait.", "The is/was free press in Iraq.  The military allows journalists to be embedded if they so wish, but if they do not wish they can run amok in Iraq.  They choose not to for the most part because of the risks involved but there are many journalists in Iraq that are not embedded.  \r\nAlso America (via California) just stepped up to the plate and ruled that bloggers have the same rights as other journalists.  \r\nI will be the first person to step up and say that our president is corrupt, I could start listing the offenses that have been more or less proved but I won't.  Lets just say I know he is corrupt and it's not tantamount to heresy.\r\n\r\nThe economist has a great write up on India this week.  \r\n\r\nUnfortunately most of the articles are only available to members.\r\n\r\n\r\nI wish india would fix it's backwards labour laws and regulations.  It could go so far if it wasn't being held back.\r\n", "I can't believe we ever fought in world war II either.  All the innocent germans that died at the hands of allied bombing.... Of course there are going to be innocent people killed in a war.  No war is going to be without civilian casualties.  Wars wouldn't be fought if we didn't fight because there would be civilian casualties.  Are wars bad, yes, should they not be fought, yes, but using civilian casualties as a reason is just arguing a result not a reason.", "Most of the good ones are in journals that require subscriptions.    is a good example.  A google of \"corporal punishment study\" reviews a bunch more.  I'll look around for some that are not hidden.", "Well lets see. What would I believe in:\r\n1. We never went to the moon.\r\n2. Evolution is a lie and creationism is right and the earth is 3500 years old.\r\n3. JFK was assassinated by the FBI/CIA\r\n4. The voting system is rigged to the point that my vote doesn't matter.\r\n5. The government is so adept it can plan out 911 and keep all the evidence of it secret.  \r\n6. Jews control the world.\r\n\r\nI'll stop now.  I would be a complete moron to believe all the conspiracy theories.  Am I interested in inconsistencies? Yes.  I am still waiting for the administration to pay for leaking a CIA name as well as miss-using intelligence.\r\n\r\nIraq was invaded to try to start a democracy in the middle of the Islamic world for Arabs.  The US also did it for oil distribution stability.  Agree or disagree this is why we went in. There were other arguments used but these are the fundamentals.  \r\n", "I think you could argue that it European secondary education is equal to the US first 2 years of college.  But I think you would be hard pressed to say it's equivalent to a full 4 year bachelors degree.   You don't know how much I can't stand our current K-12 system.", "... Don't even get me started.  \"dismiss them outright\"  You have no idea the hundreds of hours I've spent watching idiotic \"webumentries\", uninformed posts, reading extensive manuals, blogs, industry articles, books, doing math, researching \"facts\".  Dude, at this point I lump you in with the Christians conspiracy theorists that believe the earth is 3500 years old.  They say exactly the same things, use very similar arguments, and will never ever be swayed.  I bet I could provide a pretty compelling argument for the 911 conspiracy using ONLY creationist arguments.  Give me a week, I’ll see if I can’t do it.", "I've been trying to find the article but since the poor's tax liability has fallen so has their voting.  I think everyone’s taxes should rise to pay for our current deficit.  I also don't understand why people get so pissed off over a \"gap\".  Why don't you try focusing on raising everyone up, not bringing down the only ones that seem to have money?", "I like how the guardian knows when the American Dream is over.  Certainly their socialist and communist dreams are not.  If they really cared about closing the gap they would be talking about trying to get unskilled people to get productive &amp; wanted skills so they could make lots more money.  Currently we are way short of doctors/lawyers/good polititions/IT, Management/CTO/ITO/VP/CEO people.  Maybe people should try getting more skills so they can succeed.  Taxing the rich to make them poor just makes everyone poor.", "I don't think your going to find a study that has found that no corporal punishment is good.  You are more likely to find a ton that say it can be harmful.  I think the point here is that some Christians, not all, justify child abuse because of their religion.", "You should totally check up on the \"moon landings\"  they have far less evidence and the goverments report is full of holes!  Seriously, it is!\r\n \r\nWhy were objects’ shadows cast in different directions? How could an 11-by-4 foot rover squeeze into a 5-by-4 foot lunar module? Why weren’t the astronauts killed by radiation from space and the sun?\r\n\r\nMany Apollo images show astronauts standing in dark shadows, but the astronauts are plainly visible (Figure Conspiracy theorists insist that this proves that there was a light source aside from the sun illuminating the astronauts.\r\n\r\nThere is tons and tons more evidence!!!!!", "Seriously though, I've read most of it, obviously you haven't otherwise you wouldn't still be talking about crumbling towers.  You would moved on to why the government was talking to the people that paid the \"terrorists\".  You would know that the \"pentagon missile\" is just a story put out by the government to cause confusion.  All I ask is that you do some decent research.  Don't just go to one website watch a 2 hour webumentry and declare yourself a skeptic.  If you aren’t going to do at least 40 hours of research then believe the 911 report because it comes from far more believable sources.", "I got half way through the movie and turned it off.  If you want someone to make more money you need to give them skills to make more money.  If they are worth $13,861 a year they are worth $13,861 a year and so need to get skills that allow them to earn $17,650 a year. You are never going to make $100K a year as a door greater, nor should you.", "Someone just posted a pretty good over all view of the moon landing conspiracy theories.  I was mainly just trying to show joseph that there are lots of crazy conspiracy theories, it doesn't mean that they are all true, or even close to being true.  That he needs to do some real research and get some extraordinary facts to back up the extraordinary ideas of 911 conspiracy theories.", "Only buy access from providers that don't limit access based on content.  This is pretty simple stuff, I really don't understand what the fuss is about.  Why have laws that use regulation to try to stop something. it's dumb.  just buy the access you want.", "This is totally bunk.  If you were going to get lung cancer surely the air in LA would give it to you.  Minor pot smoke is just not anywhere near as bad as the air you breath in all day in LA.  Looking at people smoking 2-4 cigarettes a day here probably would give you the same results.    \r\n\r\nedit: \r\nI found the study that supports me:\r\n", "I just don't see the doom and gloom happening.  I don't see access to sites like antiwar.com or whatreallydidn'thappen.com being taken away or really changing at all.\r\n\r\nI also really dislike laws that attempt to prevent something that has yet to happen.  In Idaho I had to endure all kinds of idiotic anti gay rights laws.  All the laws were to prevent a perceived problem from happening in the future.  Why don’t we focus on fixing things that are currently wrong?  When the real problem presents itself in it’s real form and not a perceived form then lets take care of it.\r\n", "I guess I'll just ask everyone here.  What is the current problem that net neutrality would fix?  Would it change any CURRENT behavior?  If not why are we worried about it.  Lets wait for the problem to rear it’s ugly head in it’s true form and then solve the problem.  I don’t see how a government regulation can possibly solve a problem that has yet to manifest itself.", "Yes, It is better. But it still sucks ass.\r\n\r\n\r\nSmog: The most polluted = Los Angeles \r\nParticles: The most polluted cities = Los Angeles \r\n\r\n\r\nMetropolitan Areas Most Polluted by Short-term Particle Pollution #1 = Los Angeles\r\n\r\nMy arguement is that if your lungs are going to get cancer because of something you inhailed they will get cancer in LA.  Do the study somewhere that hasn't had the worst air in the country for 100 years and you'll convince me.", "hehe, I'm just making a dig at you for not explaining why you posted the link or what was relavent about the link.\r\n\r\nEdit.  Look the wiki article just sites the same study.  There really isn't any new information there.  Or would people like to explain why it's relevant?  (Which is exactly the reason you should say why you posted the link)", "This is exactly why trying to impeach Clinton was so moronic.  Now everyone wants to impeach presidents for anything they do.  From now on it won't matter who the president is or what they did... it'll be \"impeach the president\".", "No No No, you don't understand the internet is underattack!  It's like changing for the worse every second the net neutrality bill isn't signed into law!  By the end of the week there won't be an internet!  We have to do something now now now now now!!!! Government regulation is the ONLY answer!  Look how it worked for radio and TV!", "It's ALWAYS been possible.  Nothing changed because the law didn't pass.  If they DO start doing that THEN maybe we can start talking about effective safeguards.  Currently people are solving a perceived threat. It's exactly how stupid regulation gets started.", "I understand that, but it's dumb to just post links without explaining why you are doing it.  I still don't understand why he posted it.  It has ZERO new information about cancer rates in relation to smoking pot.  Am I missing something in the article?  Why did he post the article?  Was there something in the wiki article I missed I don't know he didn't give me any direction as to what I should read in it.", "Really?  So does he not buy anything from china?  Does that help china?  I'm curious what he buys and what he doesn't buy and how he makes that decision.  \r\n\r\nIt seems to me he would only be able to buy things that were made by machinery.\r\n", "So let me get this straight, we need to make MORE crap to buy in America?  We don’t have enough crap to buy from china we need to start making it here?  Interesting, I guess I could use a \"made in America\" rubber duck…", "I think the real problem with the article is that it's very reactionary and low on actual facts.  \r\n\r\nIf the dollar falls it really doesn't affect our service industry it affects our imports. Goods become more expensive so we buy less crap that we probably didn't need before anyway.  This corrects the trade imbalance because while we are buying less stuff abroad we are selling more of our exports (planes, software, movies) because they have gotten cheaper and more competitive.  You’ll probably start to see more manufacturing start up to take advantage of the current cheap dollar.   \r\n\r\nAlso his “Free trade at a continental level” is moronic.  People in Greenland are never going to be able to produce all the goods they need.  The whole point of global trade is that different areas are better able than others to produce different goods.   The fact that he fails to understand this basic point is why people with political science degrees shouldn’t be allowed to make policy without taking some basic economic classes.", "Interesting.  \r\n\r\nI have to completely agree with is buying nothing new if it can be helped.  We would have so much less pollution, wasted materials, wasted time, if people reused more stuff.\r\n \r\nI can’t agree with his “union” motto.  GM and Ford have unions and their cars are sub par, and their companies make bad decisions for everyone.  You would be hard pressed to find a US Toyota, Mazda, Subaru manufacturing employee that are not proud of their company and work.   I would have to say he would be doing a disservice to everyone by buying the ford or GM product and not buying a Subaru made in the US, by non-union US employees.\r\n", "You're point A to point D example made me think of wonderful LA, where up to 3 months ago I would have to take 3 different trains to the airport taking 2 1/2 hours for a 45 min car trip.  Though they just started a bus so I can take 1 train to a bus to the airport that only takes 1 hour 30 minutes.  Which I use when I have to use LAX.  (I live in Pasadena)", "Ok.  You got me there, Greenland is apart of the N. American continent.  My point though is that it's moronic to think that all areas are equal.  Why have North America make plastic ducks when china is more suited, at this point in time, to do it.  Why would any South American country, at this point in time, want to make a huge investment in making air planes like Boeing and Airbus if they can just buy planes from North America and Eurasia (Europe).  Why not let Africa buy food from N. America and South America so they don't have to waste so much water on poor farm ground.   \r\n\r\nBasically we are talking about comparative advantage.   \r\n\r\nAnother good thing to read is  and then read   .  It drives me nuts how hurtful our industry subsidies are to the rest of the developing world.\r\n", "If the dollar fell dramatically it would cost less in real terms to pay them back.  Plus It wouldn't cause the economy to crash.  We just wouldn't be able to import as much crap.  So people wouldn't be able to have as much crap, sure there would be some job changing but I don't think you would really see anything worse than the stock drop of 2002-2003.\r\n", "I remember in high school, right after I figured out I was an atheist, I watched a PBS show about brothers, one a rabbi and a secular Jew (agnostic).  They had separated and had decided to meet, I think, to talk about their father who had just died.  They argued about morality and religion.  I remember being struck by the idea that the rabbi couldn’t fully respect the agnostic because of his perceived shunning of god.  It struck me then how much that hit home.  Most of my Christian friends respect me to a point but I think truly deep down they harbor doubt.  If only a Christian can be saved and be goodly in gods eye, then fundamentally I should have flaws, beyond not being a Christian.  Because if I can be “good” then everyone could be good without gods grace.  I’ve discussed this with a lot of my Christian friends without getting much out of them.  I’m not sure they understand why they are ill at ease with my atheistic view of the world.  It’s just a theory though, I can’t really back it up with anything.  \r\n\r\nedit: I don't want to give the perception I think I'm all that good, I have lots of faults and have made lots of bad decisions.  I'm \"good\" in the sense that I'm not evil.", "He made some very cogent points about net neutrality.  Net neutrality is a very ambiguous term.  There currently isn’t a large problem with content getting “disrupted” due to not having paid more.  Until there is a clearer problem to solve there probably won’t be regulation.  I can see the senate going even further to not pass a bill.", "I think the real issue is that it was escalating.  That’s what really scared the country and why we took action.  I think before 9/11 people were thinking exactly that “oh terrorism is a small threat to me” but after people really started to think that it might escalate.  No one wants to wake up to terrorist attacks daily.  Look at Israel and Palestine, your more likely to die in a car than a terrorist attack but it sucks to live in a country with constant bombers.  Also after WW2 I think the idea to stop things before they escalate has really taken hold… sometimes you take action wrongly though.  I think it’s better to wait till a problem presents itself. It’s more bloody but you can solve the problem more definitively.", "The point is that we might as well start figuring out how to harness the universe around us.  As we figure out what qualities are best for space we can start cultivating that quality by looking for it and encouraging it, via a space program, and of course hot space sex.", "You should really think about trying to back up your ideas with some facts.  If you believe the dictonary definition of a word is wrong show some counter examples.  At this point you just look like a reactionary moron.", "It's amazing how much hard work and understanding can transforms a person's ideology.  Lots of cash doesn't seem to do much, just take a look at people that win the lottery, their lives don't change much.  Talk to any successful small business man and rich or poor they've probably had to change the way they think about the world.", "It's at the core of a free market/capitalist defenders heart.  As soon as you have a monopoly you no longer have a free market or capitalism going on.  It also doesn't approach zero, it aproaches a few focused companies in that market space.  Show me an industry that just has zero, or I guess 1, company running in it?\r\n\r\nA fruit that isn't organic was probably sprayed with pesticide as well as coated with a film to allow it to ripen slower or faster depending on the age of the apple when it was picked.", "It's also exactly why she is well known but unelectable.  The far left doesn't like her, the right doesn't like her.  If the democrats want to win back anything they should focus on substance rather than \"electability\".", "There are a few more than that planned but the point is that the terrorists were getting much better and more technical.  Don't forget to include the Oklahoma bombing, even though it wasn't exactly the same I think it fit into the US's reaction to 9/11.", "I think you are confusing the word \"exploit\" with the phrase \"offering a service to\".  For instance you offer a service to customers, you exploit slave labor.  You offer a service to your employer, you exploit natural resources.  See the difference?\r\n\r\nEdit:\r\nOn the other hand you are right \"exploit: make good use of (a resource)\"   in that sense we all should be exploiting our own abilities.  I guess you could look at it as exploiting your employer, but really you are exploiting yourself, you are offering a service to your employer.", "I wonder why fox news comes to your mind.  Are you thinking that North Korea is far better than this?  Have any evidence to back it up?  I've been looking at NK pictures all morning and having found anything that looks any better.  Even pictures took in the 80s look remarkably the same.", "There is a huge myth about adoption in this country that I just don't understand.  It's not a panacia, it's really difficult on everyone involved.  There is a ton of bagage that goes along with being adopted.  People that can have kids should have them and not adopt.", "Over time the bush presidency will be looked on with admiration.  The author missed some key points.  First bush was the first to put restrictions on cloning and areas related to that.  He probably set the bar too high but better too high than too low and history will smile on him for that.  Secondly his overreaction to 9/11 will be viewed as a flaw but justified in the broader context of stability in the Middle East.  It’s a mess right now but it won’t always be that way and right or wrong bush will get credit for spurring democracy in that area.  What people will forget about is what everyone is upset over now.  His tax cuts will long be forgotten, the corruption doesn’t rise to the level either, sure he is corrupt but not to the level of past presidents.  The Bay of Pigs and Iran contra are far more memorable than messing with intelligence and wire-tapping.  He will also show up in the history books for naming the 2 justices, their performance probably won’t be linked back to bush however.", "I agree with your sentiment, I would like there to be less orphans in the world and I thank people that take them in to their homes and give them a family.  However when we say “adoption is great” it has an effect on both sides.  Too many families think that there is a huge surplus of orphan babies, that’s a huge myth, there is a huge surplus of young kids that need homes.  If you can have kids have them, save the orphan babies for families that can’t have their own kids.  When there is a strong reason for adopting it has a much stronger positive effect on both sides.  Families that can’t have kids that adopt give a logical reason to the adopted kid.  Families that give up kids for a very valid reason also give the adopted kid a logical reason they can accept.  That’s the key, many reasons are not very good and leaves the adopted children confused and conflicted.   Would you like it if your parents had you out of sympathy?  Would you like to be adopted because your real parents “couldn’t afford you”?", "ok. “Real” was the wrong word.  I should have used biological, you are right.  However that doesn't remove the fact that adopted children will have to deal with the fact that their family is not their biological family.  It’s not an easy thing to deal with on all kinds of levels, both young and when they get older.", "You are right about he being remembered along with his father, who i might add was a much better president.  As to restrictions on clonin, cloning will only grow in importance in the medical field.  \r\n\r\nThe election wins were \"dubious\"  that's it.  It's not memorable other than how close it was.  If you can point to bush as masterminding the election win then you might have a point but others will probably get that credit.  \r\n\r\n\"frivolous war\", if that's all you can come up with for why he will be remembered poorly for the war, you are misjudging history.  Vietnam has a far far greater importance both for it's poor handling and it's political objectives, or lack there of.  Think about all the flack Bush sr. got for his war... how does history look on it now?  I would say not that bad, people still refer to Vietnam far more than Iraq 1.  In fact most people look at Iraq 1 as how to get global support for a war.  \r\n\r\nAs to Katrina, the government as a whole failed on that, it's hard to point the finger at bush solely.  Unless hard facts can tie Bush to saying \"fuck New Orleans\" I don't think he'll be remembered for anything about Katrina.  Just as no one remembers the president during other natural disasters, just the organization that failed to help them.\r\n", "That's how it happened.  The DPRK didn't want to agree to the terms on which the light-water reactors would be given to them.  They basically wanted them free with no restrictions and also rejected some of the terms of inspections to make certain they were complying with the NPT.  As a result I think the Bush administration decided that the DPRK was getting most of it's tech from china and if they leaned on china the problem would solve itself.  That's pretty much what has happened too.  The DPRK can't get the resources from china and china really doesn't want to piss of the US congress.  End result the DPRK is further behind then when they started their nuclear program.  Iran, and other nations, though might be able to help, also doesn't see the benefit in giving DPRK any tech.  Also much of the problem is in refining uranium, the DPRK doesn't have the power nor resources to get very far.", "I always kind of wondered if that wasn't what he meant.  I was never sure if the carrier was coming or going.  That makes a lot more sense.  \r\nSound bites drive me insain, they add almost no value, on both sides.  The right does it as much as the left and the media eats it up and wastes everyones energy on overly simplistic sound bite.", "Thank you, I did miss that.  That brings up a good point.  Europe, America and Japan all face declining populations.  Japan is solving it through longer working lives and robotics.  America is solving it through immigration (legal and illegal), and most likely longer working lives.  Europe has some serious problems to mediate over the next 30 years.", "That was the most insightful article about bush I’ve read in a while.  I agree, I watched the speech and he didn’t seem at all interested in what was going on.  It also made the republicans look more like tools of the religious right than ever.  That can only harm them in the 2006 elections.  They may please the religious right but it makes me register as a democrat and hope that I can vote in more blue dogs.", "I don't think the \"far right\" is a cohesive unit like the religious right.  You could argue it's business interests but business interests don't vote as a block they are after their own initiatives and rarely push as a force.   Small business is also very fractured.  The libertarians vote as a block for the most part but also often go for independents.  Only the religious right can completely waste congressional time with a bill that has no chance in hell of passing.", "because half the fun is seeing what everyone as a whole will upvote and downvote.  I don't really care what a bunch of political people think I want to know what the general redit crowd things of things.  Beside as soon as you have one \"X.reddit.com\" you have a 1000 and reddit becomes a boring place to go.  Downvote what you don't like upvote what you do.", "You realize i was talking about Bush 1 Iraq war 1.  Lets look at some articles... \r\n\r\n\r\n\r\ni rest my case.", "maybe it's just me but steinbeck rubs me the wrong way.  He looked down on people that thought they could be millionairs as if they were deluded and lacked understanding of how the world really worked.", "Lets start at the top: \r\n\"Capital is globally mobile. Labor is not.\"\r\nSome labor is or 1m jobs wouldn't have gone over seas.\r\n\r\nI dissagree that we havn't had as much R&amp;D in the US.  I'll use this... it's the best i could find. please find something better if you can:\r\n\r\n\r\nPlease post how the CPI (Consumer Price Index) isn't accurate. *(it isn't but how do i know it's in your favor)\r\nA blog pdf isn't good enough. I want a study, or at least some data...\r\n\r\nBernanke has raised interest rates.  I don't know about \"probably\" they have gone up 10% to get inflation under control.  Bernanke did it already. we went from 4.75 to 5.25, ok so 9%.  still.\r\n\r\n", "I disagree, working hard doesn't mean anything.  I could work hard everyday lifting weights, that doesn’t mean I should get paid well for it.  Skills are what is important, you have to get valuable skills.  Misery is a state of mind, people can be happy as long as they are able to supply for themselves.  Look at all the immigrants coming to America, they are not miserable.  They may have difficult jobs but don’t look down on people because they are not a CEO.  People have to get over the myth that money is happiness.  That doesn’t mean people shouldn’t get valuable skills to make a living but don’t paint people that don’t make a million dollars as miserable.", "I really don't disagree with you.  I just think that people will not really care about the much of his glaring faults.  Any researcher is going to be flabbergasted at the idiocy of Bush.  But say 100 years from now in a high school history book that has say 1 paragraph about Bush, what do you think they are going to say?  Look at what goes on with the Reagan legacy, Iran contra is becoming more and more of a foot note while his economic legacy is featured.  Even in the short time after Clinton most of the scandals are boiled down to the blow job and his passing of NAFTA is becoming more prominent.", "Sure, it's self-delusion, however, it's not a bad thing.  Would you rather have a bunch of people thinking they will never be rich enough, or that they won't ever be rich?  You can argue that a poor person can't become rich, but that's a different arguement.", "10% of the sons of top quintile earners in the UK and US end up in the bottom quintile.\r\n\r\n40% of the sons of fathers in the bottom quintile of earners (as of 1974) were themselves in the bottom\r\n\r\nThat hardly seems \"guaranteed\".\r\n", "I agree with your sentiments, we'll have to see, hopefully in the short term people will remember how unhelpful it is to have an idiot for a president and vote for someone with a little more sense.  It would be nice to have someone that doesn't think intelligent design is a valid theory and that gays are somehow less than a straight person.   I try to think about what I know about president ford… it isn’t much other than he was a president before Nixon.", "From what I read the police are in favor of this because it allows them to enter before people have a chance to get their guns.  Most people don't have a gun in their hand all the time, they usually pick it up to answer the door.", "This demonstrates why major media is screwed.  They sensor themselves, fundamentally they can’t get the best research and “dig” deeper if they do that.  It also shows why media today is in a flux.  I’ll sooner get my news from reddit than from the LA times and I can also count on it to be far more “fare and balanced” than fox news… as if anything isn’t more fair and balanced than them.", "This demonstrates why major media is screwed.  They sensor themselves, fundamentally they can’t get the best research and “dig” deeper if they do that.  It also shows why media today is in a flux.  I’ll sooner get my news from reddit than from the LA times and I can also count on it to be far more “fare and balanced” than fox news… as if anything isn’t more fair and balanced than them.", "Tubby, why don't you do some research to back up your arguement.  Ignoring science and going on your own hunch as to what is causing global warming is kind of like me saying your wrong because the space in between earth and the sun is really cold so the sun can't warm the earth.", "Well if you don't want to go beyond high school you have to be prepared to not have great lives.  If you are poor you can still become skilled.  My solution involves having the goverment paying for any education with 1% loan guarntees.  Kind of like student loans but with less interest and for any education.", "Wiki does a good job:\r\nThis is for \"Loose Change\" the original\r\n(video) (under Factual inaccuracies)\r\n\r\nThen \"Loose Change 2nd\" errors can be viewed here: \r\n", "I think it's funny/sad that people down modded this.  Here are some very compelling arguments about loose change and people don't want to see it.  The right has creationists and the left has 911 conspiracy nuts.", "If that were me I would have gone outside and started throwing things at it... like bullets.  I bet that is why he is so pissed off that he didn't soot it when he had the chance.  \r\n\r\nPeople probably laugh at this guy but what if it was you?  Your only recourse is to file a complaint and talk before the city council.\r\n", "I think it does. People drive different cars for a reason.  I'm not sure this needs to be a private piece, it would make more sense in a museum but it does provide insight to what was going on at the time.", "I'm not sure I would dissagree with you. I just am sick of her being on the top 20 of reddit for the past week.  It's like saying stalin isn't right, most people would agree.  I also think stalin had some points, Ann Coulter has some points too, they need to be discussed.  But it's like people think she is the devil, she isn't, she just refuses to accept she is wrong.  People give her too much credit.", "Frontline  is probably the single best news source there is.  I've never been disappointed by their coverage.  If you have time take a look at any of the shows they have online.  They just did a great show about aids and the guy in china that stood in front of the tanks.  Frontline is the best!", "So this boils down to not ignoring her because she influences people?  This is an idea that has a fundamental flaw.  Say I'm arguing something stupid like “the world is 4500 years old”.  Now you have 2 choices, argue about how I am an idiot for thinking the world is 4500 years old or arguing how the world is really about 4.5 billion years old.  It’s not that I mind people arguing against what she is saying, I have a problem with her freaking name showing up every day on reddit.  The left is making her out to be the leading right spokesperson making her far more popular than anything she says.", "I live in Pasadena and there are about 10 homeless people within a half mile of my house.  Since I walk just about everywhere I’ve gotten to know them all to some extent.  All ten have mild to serious mental issues, you can’t communicate to the serious mentals.  About half of them have an addiction to feed, usually alcohol.  Half I'm pretty sure have records, which along with smelling are the main reasons they can't get a job.  The real problem is that they have a routine down that works for them.  All ten would like to not be homeless, and I think there are some expensive and inexpensive solutions.  \r\n#1.  Institutionalize the serious mental cases.  This is expensive but in the long run better for everyone.  It would cut my homeless population by 50%\r\n#2. Free health care (including mental health)  this is also expensive but solves the problem of the people with mild mental problems that with medication could be functioning adults.  It would cut my homeless population by 25%\r\n#3. Get rid of CA Cash Refund, it allows a base pay for some homeless.  Some people can live off this, they also tend to live next to the return facilities.   This is another argument for not having a minimum wage.  They only can make about $2 an hour, I think they would benefit more from a $4 job doing something just as easy but with more interaction and honor.  They can’t get a minimum wage job because in their current condition they aren’t worth $5.75 an hour.  However they might be worth $3 or $4 an hour.  \r\n#5.  Remove idiotic crimes from peoples records.  A lot of people can’t get a job due to a record, even though the charge may be dumb.\r\nThis wouldn’t remove all the homeless within my ½ mile of Pasadena but it would get  9/10 of them off the streets and into something more beneficial for everyone.\r\n", "That is what Santorum said but the blogger heard \"we found a nuclear weapons in Iraq\".  The blogger is also convinced that we went to war because of WMDs which, I might add, is why 1/2 the democrats said went along with the war.  WMDs was only a small part of why we went to war with Iraq.  None of the reasons are good however.", "PBS has some great shows in amongst a bunch of boring stuff.  Tivo is the best at helping you only get the good stuff.  PBS has something worth watching about 2x a month, but those 2x are really good.  It’s just a hassle to find the shows that are good. Nova, frontline, some of the specials (The civil war series by ken burns, Commanding Heights: The Battle for the World Economy,   )  You just have to check each week to see if they don’t have something interesting going on.", "The only way your system would work is if the government mandated how much you earn, regardless of skill, based on your circumstances.   Everyone has a different standard of living.  A high school kid living with his parents who make a combined income of 90K is going have different needs than a father working the same job with 5 kids and a wife in the hospital.   Raising the minimum wage from $5.75 to $8.00 doesn’t make a difference to either.   If you want to help people give them skills to make more and stop with all this “living wage” baloney.   Start thinking in terms of “living skill”  or something that actually helps people.", "I agree with you, maybe insight to what was going on at the time was the wrong phrase.  It gives insight into Goering.  It's one thing to hear about the concentrantion camps, it's another thing to see them.  Just as it's one thing to hear about how goering led his life it's another thing to be able to see it.", "why is it absurd?  If it's just going to be obsorbed by the company?  $10 an hour can't support a family, why are you ok with $9 or even $15.  It seems hypocritical to me that if you support the minimum wage to help poor people why don't you support it being at a living wage?", "I agree with you there, the minimum wage doesn't solve the real issue, which are unskilled poor workers.  There are lots of jobs out there for skilled workers, however there just isn't enough training and opportunity for poor families to take advantage of them.  \r\n\r\nAlso I don't think you would see that much inflation.  Business would fire anyone they thought couldn't make them more than $20 an hour.  The reason that small increases in the minimum wage don't hurt employment levels is that most of the people earning minimum wage have high house hold incomes, so if they lost the job they wouldn't be looking for another, and not be counted as unemployed.  Also business usually gets more out of their minimum wage employees than the let the employees know.  They would keep the employees on for a few more dollars but a large raise and they would get fired.   \r\n\r\nThe real problem with raising the minimum wage to $20 an hour is that most unskilled workers would be unable to find employment.  Companies with high labor costs would automate.  There are very few things that can not be automated with the right amount of money, it’s just usually cheaper to get cheap human laber.\r\n", "Look I agree with you, education is the only way out for most poor families.  Increasing the minimum wage doesn't magically give them skills though.  Stop wasting time with the minimum wage and start talking about ways to improve education &amp; and skill training.", "My point is that the high school kid isn't living in poverty with a 5.75 an hour job and the Father of 4 is going to be in poverty unless you raise the minimum wage up to $15 an hour.\r\n\r\nThere are not a limited number of jobs.  If there were we wouldn't have an immigration problem.  We would also have a serious time trying to find jobs for our ever-growing population.  The minimum wage doesn't increase anyone’s earning potential it just sets a level of appropriate jobs.  Any job not worth the minimum wage is not done.  If you raise the minimum wage you force the father to get a better job, which he will do, and you remove the job for the high school student.  It’s a blunt tool.  I think we would be better off focusing on getting that father skills.  \r\n\r\nI still have yet to live in an area with enough competent auto mechanics.\r\n", "I'm glad you are helping people get skills.  I think that is the best answer.  Personally I would like to see the goverment give out 2% loans for education, minimum restrictions.  People would have to pay back the loan but they could get any education/skill they wished.", "lets disect this.  you are saying maybe bush is running things completely opposite the principles of conservatiesm, yet it doesn't mean they aren't an inevitable result of conservative governance?  sure.  how about you provide something that supports your position since you basically admit that bush may not follow any conservitive stance.", "\"For years critics have told the US that the war is won. Finally, they are moving towards peace by dismantling their military bases at Dog Village and Cow Point, Iraq. The areas were conquered by the US in the second Gulf War.\"  \r\n\r\n-I'm not sure comparing the six day war and Iraq 2 is justified.", "It's going to heat up before it cools down.  Isreal is sick of the peace process and has turned to a unilateral solution which is working well for them.  The palastinians are realizing too late that they have little say in the matter unless they come to terms with reality.  That reality is that there is and will be a Isreal and it is far more powerful than the governments that appose it.", "The parts are not the same.  The US is an occupier in a land they don’t even claim.  Isreal took territory, claims it as their own, and is now talking about a unilateral pullout of much of it.    We will probably always have bases in Iraq as we do in Japan and Cuba.  I don’t see how the comparison means anything.  I’m not even upset that we might have bases in Iraq going forward, though I don’t see how the local population would allow it.", "Isreal claims territory they took in the 6 day war.  Sure you can say they took the defense by having a kick ass offense, still doesn't change the facts.  Israel has never agreed to give back all the lands taken in the 6 day war.  I don't blame them, I wouldn't either.  The US never wants to control the people living in the country.  Our bases are for our people only.  Isreal wants to control the people Isreali or Palastinian that are in the territory they claime.  That's the difference.  Isreal even after the pull out of most of the west bank is going to keep chunks of it and all the people within.", "Sure does, after the 6 day war I don't see any Arab countries planning an invasion.  Israel isn't going to go back to pre 6 day war borders, Palestine is going to have to accept that and bargain for things that they can get, like free and unrestricted access to a port and the gaza strip.", "I assume they want the Golan Heights for water rights.  They will probably keep the better land that the settlements have already settled on and move out outlying settlements that are not as easily defended.  It's basically a land grab for defensive, cultural and recourse purposes.  Do I think it's right? No, but Palestine is going to have to negotiate and compromise on borders.  20 years ago they might have been able to go back to 67 borders but that time has long passed.  \r\n\r\n", "So you would rather Israel was wiped off the map as was the intent that triggered the 6 day war?  You can't have it both ways.  What would you have done if you were Israel?  Give back all of Palestine along with the other territory they gave back without concessions from the people that they weren't going to try to take you over again?  Egypt got it's land back once it recognized Israel.  Palestine had the same option and they chose to fight a war.", "So the Palestinian people didn't and wouldn't help Syria, Jordan, and Egypt take back their homeland, I seriously doubt that.  Yes, Israel fired the first shot but they did so against an almost an assured attack by their enemies.  \r\n\r\nWas Israel wrong in making settlements?  I think so, but it’s fantasy to think that now they could withdraw to 1967 borders.  I also fault the Palestinians for not acknowledging the existence of Israel and calling for its removal no matter the cost. \r\n\r\nThere is only one solution that makes any sense.  Israel has to withdraw, not to pre 1967 borders but as close as can be negotiated.  They need to allow Palestine to have full autonomy and free access to a port and the Gaza Strip.  Palestine needs to acknowledge the existence of Israel as a state and stop the attacks against it.  Once the borders are set and Israel withdraws and there are independent monitors to sort out the real story then there will be peace. \r\n\r\nAlso Iran having a bomb will not lead to peace.  As long as Palestinians have hope that they can wipe Israel off the map they will continue to try.\r\n\r\nIt seems no one likes our conversation and is downmodding us.  (I usually don't downmod/upmod any conversations.)", "\r\nI did some research on ifamericansknew.org, I found a list of all the kids that have died.  I found it odd they were all teenage boys for the most part.  So I started doing searches of each of the boys, it seems they were all planning to be martyrs for their faith and went to attempt to kill Israel soldiers / civilians with their main goal of becoming martyrs.\r\n\r\nThis is despicable.  These kids died due to brainwashing done by Palestinian extremists.  I was on the fence before, but this kind of @#$@ makes me think Israel is doing an amazing job of restraint.  Or do you think it’s ok to make little boys fight a war for you?  Despicable…\r\n", "If Iran does develop a bomb, or tries, Israel will destroy it. I think the only reason Israel is pulling out of the west bank and Gaza now is to keep a Jewish majority in the lands they have.  Palestine may have peace forced upon it.  I can only hope the Palestinian people keep voting and that America and the rest of the world stop trying to rig the elections.  I'm finally starting to hear the Palestinians talk with one voice, something I've not heard before and it's very encouraging.", "You seem to think that there has to be an alternative.  There doesn't have to be.  Just because I don't believe in Zeus doesn't mean I need something else in my life to \"fill a void\".  Are you saying without believing in the virgin birth you can't do good things?  That the only way to be a good person is to believe in the parts of the bible that don't make any sense?  \r\n", "Find me a study that shows globalization has a net negitive effect on jobs in America.  The truth is that it doesn't. College students are broke because they are going to school and not earning a living.   Granted they could borrow tons of money to live on but if you don't have to borrow money why would you?", "Well then start getting angry at the governments that allow that.  Not at walmart, they can't change it, sure they can influence it, but that's not thier job.  Would you rather Walmart not buy any goods over seas?  Would you rather have no global trade?  I don't think that helps anyone.", "I'm not saying there isn't offshoring going on.  There is. I'm saying the net effect is negligible.  We ship jobs that can be done cheaper over seas and create other jobs here.  Even your second article says \"So far, white-collar globalization probably hasn't made a measurable dent in U.S. salaries. \"  Cry about globalization all you want but it's the only thing pulling the rest of the world out of poverty while we get the benefit of having a bunch of very inexpensive labor.", "Danweber made my point for me.  \r\n\r\nWould you rather have a whole bunch of unfilled low wage jobs here?  Would you rather we all go back to agriculture, or building plastic ducks?  Times change, get skilled in something that people need here.  What we really need is inventors, small business people, CEOs, scientists, engineers, not call center employees, rubber duck assemblers.    Maybe we should end immigration too to keep people from taking our jobs.  We could get rid of all H1-11B visas and have even less of what we really need, high skilled workers.\r\n", "I should have been more specific, it's net effect on jobs is negligible.  Lets say the dollar falls, we stop buying cheap stuff we don't need anyway.  That doesn't mean a whole slew of good jobs will come back to the US.  It just means we will probably buy less stuff and export more.", "Everything that I've read puts the max population at under 10 billion.  That's the MAX forcasted human population on earth.  \r\n\r\nSo the earth heats up, we have bigger storms and more levies.  Lets focus on current problems like aids, hunger, war, and education.", "\"H1-B's have nothing to do with that -- they are a source of cheap indentured labor...\" do you know anyone with a H1-B?  The 10 or so that I know are pretty happy about being able to be here, I think they would take offense at being called indentured. \r\n\r\nYou have the preconceived notion that there are a limited number of jobs.  There isn't, the company I work for outsourced it's QA (and since brought it back)  We didn't layoff anyone, the QA team helped develop software with the savings the company gained through outsourcing.  It became apparent that language and logistics was costing more than the savings of labor so back came QA.  \r\n\r\nIf companies move jobs overseas other jobs get created to take advantage of the skilled workers.  If offshoring and outsourcing really was the panacia you think it is why would so many car manufactures make cars here?  Why is software developed here at all?  Just because someone can do your job for less doesn't mean it makes sense for a company to offshore that labor.  \r\n\r\nBTW, lots of jobs can't be offshored.  Restaurants, medical care, people that install stuff, news reporters, etc.  Skilled workers are very hard to come by, if it was easy to get skilled workers here or off shore we wouldn't have 1 million or so H1-b Visas given out each year.  Think about what you would do if you started your own business, does it make sense to offshore or outsource it?  If it does make sense you are probably underestimating the cost of outsourcing.  If not, you should go for it, you would probably make more money then you are making now.\r\n\r\nThe only jobs that are guaranteed are making clothes, food, housing and distributing them.   All the other jobs in our society are just created by someone with an idea.  If you have an idea and know of people looking for work, presto, job creation.\r\n\r\n", "Let me address your question about why low skilled jobs are low wage jobs.  The reason is efficiency.    Just about every skilled worker is going to be able to do the job he is skilled at quicker and more efficiently than someone that is not skilled.  Some jobs are rendered impossible done by unskilled workers.  You can’t provide medical care with out medical knowledge.  Look at farming, we could get rid of machinery and do everything by hand but it’s far more efficient to educate a people that can make farm machinery.  We could walk everywhere but it’s more efficient to have a bunch of people skilled at making, fixing, and operating cars/mass transit.   It’s also ridiculous to think that those efficiency gains shouldn’t benefit the people that make it happen.  That’s why you see comments about our move away from 70% of Americans doing farm labor in 1920 to 3% today.", "Quick couple points.  I don't like how we currently do H1-b, I think it has tons of problems.  We could make the prossess much easier but to do that we need immigration reform and that's a different issue.  \r\n\r\nYou can make a car in mexico and sell it in america (assuming it meets america's standards) without a tariff.\r\n\r\nIf you havn't yet you might also read through   but I think you probably have already.\r\n\r\nI guess I just don't see what you are so worried about.  If there really were a limited number of jobs we would all be unemployed.  So far all you've been able to show is that there might be a link between stagnent wages and outsourcing, but from what I've read it's really hard to make that link.  Fundamentally it makes sense to outsource if possible since other jobs will be available to the workers here and they will be able to buy cheaper goods and services with the money they do make.  Your doom and gloom of everyone out of work doesn't hold water people thought that when we moved away from everyone doing agriculture, same thing when we moved away from manufacturing.  History is on my side, untill you can demonstrate a rising enemployment rate and falling wages due directly to outsourcing you really don't have an arguement.", "\"My question is what makes any job low-wage in the first place.\"  It has everything to do with skill availability.  If everyone in the country was skilled in auto repair the wages of auto mechanics would go down.  So you are right on that count, it's not just skills.  Jobs are low-wage if everyone can do them, so I guess your argument is that if everyone in India (or what ever country) has the same skill set wouldn't that drive down labor costs for everyone with those skills.  It does, that's why people need to develop skills that aren't readily outsourced.  \r\n \r\nTake your dig at CEOs, if it's so easy why aren’t you one?  Why do they make so much money if they are so unskilled?  The reason is that very few people have the skills needed to be a CEO.  If they did we would have a lot more companies in America looking for a lot more workers driving up the cost of labor and dropping the cost of CEOs. \r\n\r\nI can see your response now, “But all jobs can be outsourced!” they can’t, if they could they would’ve.  But sure, for arguments sake lets say everything can be outsourced to India without penalty and no comparative advantage.  Do all the jobs disappear to India?  Are we all left here without anything to do and no money to buy anything that is made in India?  Are we jobless hungry people?\r\n", "Outsourcing has the exact same effect as mechanization had 100 years ago.  People back then said the same thing.  \"There won't be any jobs left, humans won't be needed for anything, machines will do it all\" it didn't come to pass instead people had to learn new skills and apply that skill to other tasks.  Think of outsourcing as just another efficiency gain because it is.  There isn't any difference between creating a call center in India and making a computer program do the exact same thing (assuming we could).", "It's a efficiency gain in terms of of the company doing the outsourcing.  Where as before it cost them $2 million it now only costs 1.75 million. \r\n\r\nBasically if your arguement that outsourcing drives down the cost of certain IT and results in less IT jobs in the US I would be hard pressed to dissagree.  My arguement is that we don't help ourselves by being protectionist.  If we stop outsourcing and immigration we are doomed to be 2nd best as the world speeds ahead of us.  We have to embrace globalisation so that all nations can rise up.  People need to look to thier own competitive advantages and specialize.  Is it going to be easy? NO.  We can look at manufacturing decline and the great depression as examples of poor transitions. \r\n\r\n", "So are you saying that we should cease all trade with china, mexico, guatamala, ?  How does that help those countries?  How are those countries ever going to be able to get out of subsistance poverty if they can't trade?", "In order to make Wal-Mart pay for the environmental damage their suppliers create you would have to usurp local government laws, so the only way to make it work would be to not trade with those countries.  In many cases I think that's what we have to do.  We don't trade with a lot of nations that we find to be at least mildly following basic human rights, that's why you can't buy Cuban cigars or North Korean stuff.  \r\n\r\nI guess we pretty much agree on that then.  I draw the line a little differently then you on environmental damage.  I think our trade with china and India is only improving the lives of their people and as their lives get better they are instituting more environment reforms.  It's hypocritical to not trade with India and China on environmental basis since we pollute more than they do.\r\n", "I think we agree on this as a whole.  I'm against that kind of stuff to, and this stuff is banned both in china and India.  I'll have to look but I think companies here can be partly liable for damages caused by partners over seas.  The real problem is enforcement, we even have problems in this country with enforcement.  You can't really blame trade for this, these problems have to be dealt with localy or they will never be fixed.  The best you can do is put international pressure on them and not by products that you feel aren't made enviromentally friendly.  Banning imports/exports just puts off the problem to when they do again start creating those products."]}]